[
  {
    "speaker": "James",
    "text": "[dry] So, Cassandra. Daughter of Priam, prophetess of doom, utterly unheeded. Sound familiar?"
  },
  {
    "speaker": "Elena",
    "text": "Are we really equating climate scientists to a mythical Trojan princess now? That feels a bit dramatic."
  },
  {
    "speaker": "James",
    "text": "The article does. And the core argument is less about drama, more about the brutal reality: it's too late for prevention."
  },
  {
    "speaker": "Elena",
    "text": "Too late? That's a surrender, James. We have the data, we know the drivers."
  },
  {
    "speaker": "James",
    "text": "[emphatic] The data shows we're already locked into a 1.6 degrees Celsius global temperature rise. Locked in."
  },
  {
    "speaker": "Elena",
    "text": "1.6? But the international agreements, Paris... that was for keeping us under two."
  },
  {
    "speaker": "James",
    "text": "Aspirational. Cumulative emissions are a physical fact. We've emitted too much already."
  },
  {
    "speaker": "Elena",
    "text": "But 'no viable political solution'? That's a strong claim."
  },
  {
    "speaker": "James",
    "text": "To stay below two degrees, we'd need to stop *all* greenhouse gas emissions immediately. Every single one. Globally."
  },
  {
    "speaker": "Elena",
    "text": "That's an impossible ask, obviously."
  },
  {
    "speaker": "James",
    "text": "Exactly. So, the political solution isn't going to happen."
  },
  {
    "speaker": "Elena",
    "text": "No, that's completely wrong, and I'll tell you why. Incremental change, huge investment in renewables..."
  },
  {
    "speaker": "James",
    "text": "Incremental won't reverse the cumulative effect fast enough. We've had thirty years since Rio."
  },
  {
    "speaker": "Elena",
    "text": "So all that effort was pointless?"
  },
  {
    "speaker": "James",
    "text": "[sardonic] Ineffectual, certainly, if the goal was to avoid the 1.6-degree lock-in."
  },
  {
    "speaker": "Elena",
    "text": "I think you're cherry-picking. The 'renewables and battery revolution' article painted a far more hopeful picture."
  },
  {
    "speaker": "James",
    "text": "Hope is one thing. The scale and speed of global coordination required is another. Look at the grid problems for 'European Electricity Utilities'."
  },
  {
    "speaker": "Elena",
    "text": "But individual nations *can* act. They can set price floors for energy, they can build new infrastructure."
  },
  {
    "speaker": "James",
    "text": "They can. But the article's core point: international institutions — UN, WTO, World Bank — won't survive the turmoil."
  },
  {
    "speaker": "Elena",
    "text": "Collapse? That's a huge leap. These structures have weathered storms before."
  },
  {
    "speaker": "James",
    "text": "They rely on stability. Climate change will unleash instability on a scale the 20th-century models just can't handle."
  },
  {
    "speaker": "Elena",
    "text": "So, every nation for itself? That's exactly the kind of thinking that got us into this mess!"
  },
  {
    "speaker": "James",
    "text": "It's pragmatic. When the global food supply chain breaks, as HFN warned in 'Consequences of Inaction', nations will prioritise their own."
  },
  {
    "speaker": "Elena",
    "text": "But that's an abdication of shared responsibility. The 'immorality of climate change' piece made a powerful case for global solidarity."
  },
  {
    "speaker": "James",
    "text": "[thoughtful] I don't want to agree with you on this, but the numbers don't leave much room. If 1.6 degrees is baked in, and we won't stop emitting globally..."
  },
  {
    "speaker": "Elena",
    "text": "Well, okay, if the 1.6 degrees is truly unavoidable, then yes, adaptation is critical."
  },
  {
    "speaker": "James",
    "text": "And the article suggests we're heading for 3, 4, or 5 degrees, not just 1.6."
  },
  {
    "speaker": "Elena",
    "text": "Wait, really? What pushes it beyond the already locked-in figure?"
  },
  {
    "speaker": "James",
    "text": "Because we won't cease emitting. It's a treadmill, Elena. You called it that yourself."
  },
  {
    "speaker": "Elena",
    "text": "I did. A treadmill. Okay, I see that. It compounds."
  },
  {
    "speaker": "James",
    "text": "So, national planning. Prioritising your country, then your region. Food security, energy independence."
  },
  {
    "speaker": "Elena",
    "text": "But the erosion of international law, the breakdown of global cooperation... that's truly terrifying."
  },
  {
    "speaker": "James",
    "text": "[conceding] It's not a pleasant outlook. But if those institutions aren't robust enough, they'll collapse anyway."
  },
  {
    "speaker": "Elena",
    "text": "So we just... prepare for it? No effort to prop them up?"
  },
  {
    "speaker": "James",
    "text": "The effort, the article implies, is now best directed at national resilience. Hope for the best, plan for the worst."
  },
  {
    "speaker": "Elena",
    "text": "And the worst involves every nation for itself, sacrificing global good for local survival."
  },
  {
    "speaker": "James",
    "text": "Shared responsibility becomes a luxury when the harvests fail and the grid goes down."
  },
  {
    "speaker": "Elena",
    "text": "[clipped] A bleak future, James. Cassandra was right, then."
  },
  {
    "speaker": "James",
    "text": "She usually is. It's the belief, or lack thereof, that defines the outcome."
  }
]