[
  {
    "speaker": "James",
    "text": "[dry] The Weimar Republic, 1932. German defence spending, less than one percent of GDP. Seven years later, it was twenty-three percent. That's faster than paying off a car loan."
  },
  {
    "speaker": "Elena",
    "text": "Oh, come on. You can't start with Hitler. That's a historical outlier, not a pattern."
  },
  {
    "speaker": "James",
    "text": "Except it is the pattern. The article details five prior European rearmament cycles. Each one followed a devastating war, a period of disarmament, then a new threat. And then..."
  },
  {
    "speaker": "Elena",
    "text": "And then war. You're saying it's inevitable this time too?"
  },
  {
    "speaker": "James",
    "text": "Not inevitable, but highly probable without significant change. Europe is currently spending EUR 800 billion on defence. Poland is over four percent of GDP already."
  },
  {
    "speaker": "Elena",
    "text": "Right, because Russia invaded Ukraine. That's a direct, immediate threat. It's not some abstract historical rhythm."
  },
  {
    "speaker": "James",
    "text": "But the peace dividend of the last three decades systematically dismantled Europe's industrial capacity. That's the key. Remember the EU couldn't deliver one million artillery shells?"
  },
  {
    "speaker": "Elena",
    "text": "That's a logistical problem, not a structural one."
  },
  {
    "speaker": "James",
    "text": "[emphatic] It is absolutely structural. Rheinmetall was producing 70,000 shells a year. Russia, three million. That's a capacity problem, not a logistics problem."
  },
  {
    "speaker": "Elena",
    "text": "So you're saying Europe just let its guard down? Foolishly?"
  },
  {
    "speaker": "James",
    "text": "We assumed Russia was defanged, America would always guarantee security, and economic interdependence made war impossible. All wrong."
  },
  {
    "speaker": "Elena",
    "text": "That's a convenient reading of the data. We prioritised social spending, healthcare, education. That's hardly foolish."
  },
  {
    "speaker": "James",
    "text": "No, it's just a trade-off. We got welfare states. We lost the ability to defend them. That's the reality."
  },
  {
    "speaker": "Elena",
    "text": "[frustrated] But this isn't the 1930s. We have NATO. We have the EU. There are institutions now."
  },
  {
    "speaker": "James",
    "text": "Institutions are only as strong as their members' commitment. Spain, for instance, capping defence at 2.1% of GDP. Poland looks at that and wonders what NATO actually means."
  },
  {
    "speaker": "Elena",
    "text": "Wait, really? Spain isn't committing to the 3.5%?"
  },
  {
    "speaker": "James",
    "text": "No. The article makes it clear: there's a geography of fear. Countries closer to Russia spend more."
  },
  {
    "speaker": "Elena",
    "text": "So, divisions within the alliance. That's hardly a recipe for stability, is it?"
  },
  {
    "speaker": "James",
    "text": "Exactly. And then there's the fragmentation. Twenty-seven national armies, twenty different types of tanks, twenty-nine frigates. The US has one of each."
  },
  {
    "speaker": "Elena",
    "text": "That's just wasteful. So this EUR 800 billion won't even buy us proper defence?"
  },
  {
    "speaker": "James",
    "text": "Not if 78% of procurement goes outside Europe, mostly to the US. We're paying America to defend us, while talking about strategic autonomy. It's absurd."
  },
  {
    "speaker": "Elena",
    "text": "I think you're overstating the fragmentation problem. The EU has joint procurement mechanisms. They're trying to fix it."
  },
  {
    "speaker": "James",
    "text": "Joint programmes like the Eurofighter or the A400M? Years late, billions over budget. Every government wants its own industry to benefit. Local jobs, not pan-European efficiency."
  },
  {
    "speaker": "Elena",
    "text": "Okay, fine. That's harder to argue with than I expected. The industrial policy angle is... sticky."
  },
  {
    "speaker": "James",
    "text": "[thoughtful] But there is a twist. This time could be different. Not because we're better, but because of necessity."
  },
  {
    "speaker": "Elena",
    "text": "Go on. This sounds like a stretch."
  },
  {
    "speaker": "James",
    "text": "If Europe wants genuine military capability, it *has* to integrate. Standardise, rationalise, share logistics. Like the US military after the Civil War."
  },
  {
    "speaker": "Elena",
    "text": "So, rearmament could force deeper integration? A European army?"
  },
  {
    "speaker": "James",
    "text": "Precisely. Not out of idealism, but out of sheer economic pressure. When you're spending five percent of GDP, you can't afford duplication."
  },
  {
    "speaker": "Elena",
    "text": "Well... that's a fascinating, if rather dark, way to achieve unity. It's definitely not what I thought you'd say."
  },
  {
    "speaker": "James",
    "text": "It would be the first time the pattern was genuinely broken. A collective defence, too strong to challenge, too integrated to misuse."
  },
  {
    "speaker": "Elena",
    "text": "But you mentioned earlier, the weapons you build for one threat get used for another. What about that 'North African Threat' we discussed? Or China?"
  },
  {
    "speaker": "James",
    "text": "That's the enduring danger. Military-industrial complexes acquire their own momentum. Eisenhower warned us."
  },
  {
    "speaker": "Elena",
    "text": "So we could end up with a hugely powerful, integrated European military... pointed at the wrong problem in twenty years?"
  },
  {
    "speaker": "James",
    "text": "Or creating new problems. That's the uncomfortable truth of rearmament, historically."
  },
  {
    "speaker": "Elena",
    "text": "[conceding] So it's a gamble. A necessary one, perhaps, but a gamble all the same."
  },
  {
    "speaker": "James",
    "text": "A gamble on the most valuable anomaly in European history. We've lived our entire lives in an exception."
  },
  {
    "speaker": "Elena",
    "text": "The 80 years of major power peace. You mean that?"
  },
  {
    "speaker": "James",
    "text": "That's it. For 400 years prior, major wars every 30-40 years. We've mistaken the exception for the rule."
  },
  {
    "speaker": "Elena",
    "text": "The bill has arrived, as the article says. And the answer defines the century."
  }
]