[
  {
    "speaker": "James",
    "text": "[provocative] We talk endlessly about trade deficits, but the real mystery is why Western politicians keep promoting a system that essentially offshores our jobs and wealth."
  },
  {
    "speaker": "Elena",
    "text": "Mystery? It's hardly a mystery, James. Corporations chase profit, consumers want cheaper goods. Supply and demand, right?"
  },
  {
    "speaker": "James",
    "text": "Ah, the 'cheap goods' illusion. Remember the article's laser printer example? £100 imported, maybe £115 if made locally."
  },
  {
    "speaker": "Elena",
    "text": "Fifteen quid is fifteen quid for someone on a budget. That's a real saving."
  },
  {
    "speaker": "James",
    "text": "[dry] But is it a saving if you or your neighbour then end up on benefits, funded by everyone else's taxes?"
  },
  {
    "speaker": "Elena",
    "text": "You're saying outsourcing is the sole cause of unemployment? That's far too simplistic."
  },
  {
    "speaker": "James",
    "text": "Not sole, no. But the article's numbers are stark. Take the UK: supporting one unemployed person costs the taxpayer £27,184 a year."
  },
  {
    "speaker": "Elena",
    "text": "Benefits and lost taxes, yes. That's a social safety net, not a direct cost of outsourcing."
  },
  {
    "speaker": "James",
    "text": "It's a direct cost if the job that person *could* have had went to Shanghai instead. Thirty-five percent of an average Briton's income tax already covers unemployment. Thirty-five percent!"
  },
  {
    "speaker": "Elena",
    "text": "Well... okay, that's a significant chunk. But what about the millions lifted out of poverty in Asia? That has value too."
  },
  {
    "speaker": "James",
    "text": "[clipped] Value for them, certainly. But we're discussing the West's economic sustainability here."
  },
  {
    "speaker": "Elena",
    "text": "We can't just seal our borders and expect to compete globally. Comparative advantage—"
  },
  {
    "speaker": "James",
    "text": "The article explicitly says Ricardian theory isn't working anymore. Or never did, effectively. Look at Europe."
  },
  {
    "speaker": "Elena",
    "text": "Europe's a mess for many reasons beyond outsourcing."
  },
  {
    "speaker": "James",
    "text": "Indeed. But the EU17 average unemployment rate in 2013 was 12.1%. If the UK had that, 59% of an average worker's income tax would fund unemployment."
  },
  {
    "speaker": "Elena",
    "text": "Fifty-nine percent? That's... insane."
  },
  {
    "speaker": "James",
    "text": "It means two months' salary, effectively, to support those without jobs."
  },
  {
    "speaker": "Elena",
    "text": "But that's an average. Germany skews it down, right?"
  },
  {
    "speaker": "James",
    "text": "Precisely. Now consider Greece. Twenty-seven point three percent unemployment."
  },
  {
    "speaker": "Elena",
    "text": "Oh, no."
  },
  {
    "speaker": "James",
    "text": "At that rate, the cost to UK taxpayers would be £10,208 per worker, per year."
  },
  {
    "speaker": "Elena",
    "text": "Wait, really? How much is that compared to their total tax?"
  },
  {
    "speaker": "James",
    "text": "More than the average worker's entire income tax contribution. It's equivalent to six months of additional income for every employed person."
  },
  {
    "speaker": "Elena",
    "text": "[frustrated] Six months? That's completely unsustainable. That's a national collapse."
  },
  {
    "speaker": "James",
    "text": "Indeed. The article states it would devastate the UK's budget, almost equalling combined spending on defence, education, and health."
  },
  {
    "speaker": "Elena",
    "text": "I... I don't want to agree with you on this, but the numbers don't leave much room. That's actually devastating."
  },
  {
    "speaker": "James",
    "text": "And youth unemployment is even higher. It's a ticking time bomb."
  },
  {
    "speaker": "Elena",
    "text": "So, the 'cheap' goods are actually making us poorer. It's like that printer again, or the credit card interest you don't see."
  },
  {
    "speaker": "James",
    "text": "Exactly. The life-cycle cost is what matters. We're externalising the cost onto our own welfare systems."
  },
  {
    "speaker": "Elena",
    "text": "It reminds me of that article on the immorality of climate change, where we externalise pollution. Same principle, different metric."
  },
  {
    "speaker": "James",
    "text": "Precisely. And it gets worse geopolitically. The US spends $137 billion a year securing Pacific trade routes."
  },
  {
    "speaker": "Elena",
    "text": "To protect trade with the very countries we have massive deficits against."
  },
  {
    "speaker": "James",
    "text": "Four hundred billion in trade deficits annually to Asian countries. Plus the military cost. It's a staggering $537 billion drain for the US."
  },
  {
    "speaker": "Elena",
    "text": "That's a colossal transfer of wealth. And we're paying for the privilege."
  },
  {
    "speaker": "James",
    "text": "An annual transfer equivalent to $1,700 per American. Every man, woman, and child."
  },
  {
    "speaker": "Elena",
    "text": "So, the Decline of the West piece starts to make a lot more sense now. We're actively undermining ourselves."
  },
  {
    "speaker": "James",
    "text": "Which brings us back to the 'mystery'. Why do politicians promote this?"
  },
  {
    "speaker": "Elena",
    "text": "Short-term consumer gratification, maybe. Or they genuinely believe the comparative advantage myth. Blindness, perhaps?"
  },
  {
    "speaker": "James",
    "text": "Perhaps. But the long-term data screams otherwise. It’s not just a problem for society; it’s a cost for every single taxpayer."
  }
]