[
  {
    "speaker": "James",
    "text": "[dry] Angela Merkel's 'Wir schaffen das' was presented as a moral imperative. Historically? It was an aberration."
  },
  {
    "speaker": "Elena",
    "text": "An 'aberration'? Or simply a modern state responding with compassion to a humanitarian crisis? We're not in the 3rd century BC."
  },
  {
    "speaker": "James",
    "text": "For five millennia, every successful civilisation controlled its borders. Tightly. The idea of large-scale, culturally distinct immigration as a principle is barely 60 years old in the West."
  },
  {
    "speaker": "Elena",
    "text": "That's a rather sweeping generalisation, isn't it? The Romans absorbed many peoples. The Ottomans were a mosaic."
  },
  {
    "speaker": "James",
    "text": "[clipped] The Romans granted citizenship with exquisite care. Until they didn't. The Ottomans managed groups, they didn't make them interchangeable. Big difference."
  },
  {
    "speaker": "Elena",
    "text": "But you're ignoring the context. The post-war West needed labour. We built these economies on it."
  },
  {
    "speaker": "James",
    "text": "Gastarbeiter were explicitly temporary. They didn't go home, did they? That's the crucial point."
  },
  {
    "speaker": "Elena",
    "text": "Well, cultures change, people settle. Is that so bad? Diversity is strength."
  },
  {
    "speaker": "James",
    "text": "[sardonic] 'Diversity is strength.' A lovely slogan. The Sumerians had specific laws barring non-citizens from owning land. Athenians restricted citizenship to those born of two Athenian parents. Aristotle couldn't vote."
  },
  {
    "speaker": "Elena",
    "text": "That's ancient history! We've evolved beyond that narrow view of belonging. Surely?"
  },
  {
    "speaker": "James",
    "text": "The Chinese built a wall. The Japanese closed their country for 200 years and produced one of the most culturally cohesive societies on Earth. They understood the principle."
  },
  {
    "speaker": "Elena",
    "text": "A wall? Sakoku? Those are extreme examples, not models for a modern, globalised West."
  },
  {
    "speaker": "James",
    "text": "They were effective. The Ming rebuilt the Wall after expelling the Mongols. Not against a specific threat, but against the *principle* of uncontrolled entry."
  },
  {
    "speaker": "Elena",
    "text": "No, that's completely wrong. You're presenting a selective history. You're ignoring the economic benefits, the cultural enrichment—"
  },
  {
    "speaker": "James",
    "text": "Are we? The data doesn't quite back that up. Look at the fiscal impact studies."
  },
  {
    "speaker": "Elena",
    "text": "Wait, what fiscal impact?"
  },
  {
    "speaker": "James",
    "text": "[emphatic] Danish Ministry of Finance, 2018. Non-Western immigrants, a net fiscal cost of 33 billion DKK per year. Dutch Central Planning Bureau: average non-Western immigrant, a net lifetime fiscal cost of EUR 43,000."
  },
  {
    "speaker": "Elena",
    "text": "That's... selective, isn't it? What about the EEA migrants the UK MAC found were net contributors?"
  },
  {
    "speaker": "James",
    "text": "Precisely my point. Culturally and economically similar, net positive. Dissimilar, net negative. It's an accounting fact, not a moral judgement."
  },
  {
    "speaker": "Elena",
    "text": "But you're reducing people to numbers. What about the human element? The refugees?"
  },
  {
    "speaker": "James",
    "text": "The article isn't moralising. It's presenting the historical pattern and the economic data. It's a question of sustainability."
  },
  {
    "speaker": "Elena",
    "text": "Okay, fine. I'll give you the fiscal data looks... challenging for certain groups. But integration is key, right? We just need to do better at it."
  },
  {
    "speaker": "James",
    "text": "But the data on integration, Elena? Third-generation North Africans in France, unemployment rates double the national average. Swedes, Somali, Afghan, Iraqi immigrants below 40% employment after ten years. These are not isolated incidents."
  },
  {
    "speaker": "Elena",
    "text": "Well... okay, that's harder to argue with than I expected. But it doesn't mean it's impossible. We just need to invest more."
  },
  {
    "speaker": "James",
    "text": "[thoughtful] And then there's Putnam's work on social trust. Ethnic diversity reducing trust, not just between groups, but within them. That's a profound cost."
  },
  {
    "speaker": "Elena",
    "text": "I remember that. He was a liberal, trying to disprove his own findings. And he couldn't."
  },
  {
    "speaker": "James",
    "text": "Exactly. It's been replicated globally. Rapid, large-scale demographic change has real costs for social cohesion. Costs our policymakers consistently ignore."
  },
  {
    "speaker": "Elena",
    "text": "So, what's the alternative then? Shut the gates entirely? Go full Japan?"
  },
  {
    "speaker": "James",
    "text": "The article suggests three scenarios: the Roman path, the Japanese correction, or the Singapore model. Remember our 'Decline of the West' piece? That's the Roman path."
  },
  {
    "speaker": "Elena",
    "text": "The Roman path... where citizenship became meaningless, and the army was filled with foederati. That's a grim parallel."
  },
  {
    "speaker": "James",
    "text": "Indeed. The distinction between Roman and barbarian blurred. Odoacer, a Roman general, deposed the last Western emperor. Not a conquest, but a change of management."
  },
  {
    "speaker": "Elena",
    "text": "But the Singapore model... strict economic contribution, no family reunification, easy to lose residency. That feels... cold."
  },
  {
    "speaker": "James",
    "text": "It's pragmatic. And historically, it's what every successful civilisation did before 1965. Including, for most of its history, the United States."
  },
  {
    "speaker": "Elena",
    "text": "The 'nation of immigrants' was actually quite restrictive. Hart-Celler really changed everything."
  },
  {
    "speaker": "James",
    "text": "Senator Ted Kennedy promised it wouldn't change the ethnic mix. He was profoundly wrong. Foreign-born share went from 4.7% to 14%."
  },
  {
    "speaker": "Elena",
    "text": "Okay, okay. I get it. The historical evidence is... quite compelling that the West is on an unprecedented experiment."
  },
  {
    "speaker": "James",
    "text": "And public opinion has consistently rejected it for fifty years. The Brexit vote, the rise of the AfD. The gap never closes."
  },
  {
    "speaker": "Elena",
    "text": "So, we're either heading for a Roman-style fragmentation, or we need a dramatic correction. But what about the moral argument? Isn't there still a duty of care?"
  },
  {
    "speaker": "James",
    "text": "A duty of care to whom? Our own citizens? Future generations? History suggests that ignoring these structural forces leads to collapse, not moral triumph. The gates are still in our hands, as the article puts it. The question is, do we have the will to use them?"
  }
]