[
  {
    "speaker": "James",
    "text": "[emphatic] The article calculates the UK spent £11 million per life saved from Covid-19, just in additional government debt. £400 billion for 34,000 deaths."
  },
  {
    "speaker": "Elena",
    "text": "That's a provocative number, James. But you can't just divide total spending by a death toll and call it the 'value of a life'."
  },
  {
    "speaker": "James",
    "text": "It's an explicit cost. A choice governments made. Other considerations became secondary."
  },
  {
    "speaker": "Elena",
    "text": "To save lives, yes. Are you suggesting we shouldn't have done that?"
  },
  {
    "speaker": "James",
    "text": "[dry] I'm suggesting the value we placed on individual human life reached a peak point. An unsustainable one, financially speaking."
  },
  {
    "speaker": "Elena",
    "text": "Hmm. But isn't that a good thing? It reflects progress, a more empathetic society."
  },
  {
    "speaker": "James",
    "text": "Historically, we've always valued life more as societies became wealthier. But this was unprecedented. Remember the article on 'Crisis: Or An Explanation On The Origins Of The Decline Of The West'?"
  },
  {
    "speaker": "Elena",
    "text": "Yes, it touched on societal resilience. But this feels different."
  },
  {
    "speaker": "James",
    "text": "The article suggests it directly links to declining military conflict, too. If people value life this much, sending them to war becomes culturally harder."
  },
  {
    "speaker": "Elena",
    "text": "That's a huge leap. Trillions spent on disease, yes. But war is different."
  },
  {
    "speaker": "James",
    "text": "Think about it. The Somme, 19,000 killed on day one. Unimaginable now."
  },
  {
    "speaker": "Elena",
    "text": "Okay, the scale of acceptable loss has changed. I'll grant you that. But military budgets were already shrinking, generally."
  },
  {
    "speaker": "James",
    "text": "Exactly. Covid-19 accelerates it. Governments need to cut costs. The military, which did nothing during the pandemic, is an easy target."
  },
  {
    "speaker": "Elena",
    "text": "So, fewer wars? I'd like to believe that. But that's incredibly optimistic."
  },
  {
    "speaker": "James",
    "text": "Look at the West's supply chains. Can't even make masks. How do you kit out a high-tech army to fight a rival? Read 'Europe Rearms' for a counter-point, but this article says the West is too hollowed out."
  },
  {
    "speaker": "Elena",
    "text": "That's exactly the kind of structural issue the pandemic exposed. Our reliance on outsourced production, especially from East Asia."
  },
  {
    "speaker": "James",
    "text": "Which brings us to the rise of the East. East Asian countries managed Covid-19 far better."
  },
  {
    "speaker": "Elena",
    "text": "They did. Faster response, more compliant populations, certainly. But that's not just about economics, is it?"
  },
  {
    "speaker": "James",
    "text": "It's a questioning of Western superiority. Something taken for granted for centuries."
  },
  {
    "speaker": "Elena",
    "text": "And the article points to 'virtual immigration' as a devastating impact for high-income countries. That's a strong claim."
  },
  {
    "speaker": "James",
    "text": "Once you accept working from home, location matters less than time zone and internet. Then Bangalore looks attractive compared to London wages."
  },
  {
    "speaker": "Elena",
    "text": "I see the logic. But 'devastating' seems a bit much. Surely it opens up opportunities globally?"
  },
  {
    "speaker": "James",
    "text": "For low-cost countries, yes. For Western white-collar workers, they're suddenly competing with a much larger talent pool, at a fraction of the cost."
  },
  {
    "speaker": "Elena",
    "text": "So, we're talking about a significant erosion of Western wages. That's... actually devastating for some sectors."
  },
  {
    "speaker": "James",
    "text": "[conceding] It is. And it's almost impossible for governments to control."
  },
  {
    "speaker": "Elena",
    "text": "Right. Because it's not physical immigration you can regulate at the border. It's digital. This is more insidious than I first thought."
  },
  {
    "speaker": "James",
    "text": "Indeed. Then consider mass migration, which the article says is 'broken history'."
  },
  {
    "speaker": "Elena",
    "text": "The pause due to border closures, yes. But that will surely pick up again?"
  },
  {
    "speaker": "James",
    "text": "Not necessarily. The article talks about 'chain migration'. If that's broken for even a few years, it disrupts the entire network."
  },
  {
    "speaker": "Elena",
    "text": "The social fabric that pulls new immigrants in... you're right, that could have a lasting impact. Fewer family ties to follow."
  },
  {
    "speaker": "James",
    "text": "And with high unemployment in the West, and furlough schemes often not available to new immigrants, why move?"
  },
  {
    "speaker": "Elena",
    "text": "No, that's a fair point. That's a serious barrier. And then there's the unemployment Jenga block analogy for the wider economy."
  },
  {
    "speaker": "James",
    "text": "Airlines, hotels, city centre shops. It's not just one falling. It's a cascade. We touched on this in 'Robotics And Slavery' and the future of work."
  },
  {
    "speaker": "Elena",
    "text": "So, fewer jobs, less demand for physical spaces. More people questioning why they live in cities. That's a profound shift."
  },
  {
    "speaker": "James",
    "text": "Potentially. The article implies cities might shrink, or at least change character dramatically."
  },
  {
    "speaker": "Elena",
    "text": "Well, okay, that's harder to argue with than I expected. The compounding effects are... stark. But what about the 're-shoring' wishful thinking?"
  },
  {
    "speaker": "James",
    "text": "The article is quite clear. Companies will still find it easier to deal with East Asian suppliers unless governments *mandate* re-shoring."
  },
  {
    "speaker": "Elena",
    "text": "And governments have the power to do that now, post-Covid, when companies are 'supplicants'?"
  },
  {
    "speaker": "James",
    "text": "Precisely. The state is back. But for how long? That's the unanswered question."
  },
  {
    "speaker": "Elena",
    "text": "So, we're left with a world where life is valued at an impossible price, the West is weaker, jobs are digitised and globalised, migration patterns are broken, and governments are stronger but for an unknown duration. It's a lot to process."
  }
]