[
  {
    "speaker": "Elena",
    "text": "The Outer Space Treaty of 1967 is dead, James. Or, at best, a historical footnote like the Treaty of Tordesillas."
  },
  {
    "speaker": "James",
    "text": "[dry] A strong opening, Elena. 'Dead' already? I thought it still had some life support."
  },
  {
    "speaker": "Elena",
    "text": "It was written when only two nations could reach space. Now, SpaceX alone has driven launch costs from $54,000 per kilogram to under $2,000. They're targeting $50."
  },
  {
    "speaker": "James",
    "text": "[surprised] That's... genuinely shocking. A hundred-fold reduction."
  },
  {
    "speaker": "Elena",
    "text": "Precisely. And the resources? The asteroid 16 Psyche alone is estimated to contain $10,000 quadrillion in minerals."
  },
  {
    "speaker": "James",
    "text": "[amused] A cosmic gold rush, then. Potosí scaled up to the solar system."
  },
  {
    "speaker": "Elena",
    "text": "It's not just gold. We're talking helium-3 for fusion, water ice for rocket fuel, rare earth elements. Critical materials."
  },
  {
    "speaker": "James",
    "text": "True. The potential for wealth generation is immense. Beyond anything on Earth."
  },
  {
    "speaker": "James",
    "text": "[thoughtful] This brings back the chartered company model, doesn't it? SpaceX as the new East India Company, effectively."
  },
  {
    "speaker": "Elena",
    "text": "With private armies soon, I suppose? That's a terrifying prospect for global governance."
  },
  {
    "speaker": "James",
    "text": "The English East India Company had a private army of over 250,000 men. The Dutch VOC was worth more than Apple, Google, and Amazon combined."
  },
  {
    "speaker": "Elena",
    "text": "[frustrated] That's exactly the kind of unconstrained power that led to centuries of exploitation. It's not a model we should be repeating."
  },
  {
    "speaker": "James",
    "text": "But governments historically couldn't fund these ventures alone. Can they now?"
  },
  {
    "speaker": "Elena",
    "text": "The US isn't waiting. The Commercial Space Launch Competitiveness Act of 2015 grants private citizens resource rights. The Artemis Accords establish 'safety zones'."
  },
  {
    "speaker": "James",
    "text": "So, effective occupation, but by corporations under national frameworks."
  },
  {
    "speaker": "Elena",
    "text": "Precisely. And China hasn't signed the Artemis Accords. Russia and India are doing their own thing. It's a fragmented legal vacuum."
  },
  {
    "speaker": "James",
    "text": "[emphatic] This is where the 'robots first' point in the article becomes critical. No human mortality, no life support."
  },
  {
    "speaker": "Elena",
    "text": "It's still a scramble, James. Just with automatons doing the colonising."
  },
  {
    "speaker": "James",
    "text": "Robots allow speed and scale unheard of in human history. They operate continuously, in conditions that would kill us in minutes. Think of the 'Robotics And Slavery' article."
  },
  {
    "speaker": "Elena",
    "text": "[heated] But the implications for human control and ownership are terrifying. Who decides the ethics of an AI-driven colonial venture?"
  },
  {
    "speaker": "James",
    "text": "They're better colonists in almost every practical sense. Cheaper, more resilient, no complaints about the food."
  },
  {
    "speaker": "Elena",
    "text": "So the nations with the most advanced AI and robotics get to own everything off-world? That's your conclusion?"
  },
  {
    "speaker": "James",
    "text": "[thoughtful] The article makes that argument rather compellingly. Those without the advanced robotics will be like the colonised nations of the past. Dependent."
  },
  {
    "speaker": "Elena",
    "text": "[pushback] That's an unacceptable outcome for global equity. This can't just be a free-for-all for the technologically advanced."
  },
  {
    "speaker": "James",
    "text": "What's the mechanism to prevent it? A global space agency with no enforcement?"
  },
  {
    "speaker": "Elena",
    "text": "A genuine international framework, not unilateral land grabs and 'safety zones'."
  },
  {
    "speaker": "James",
    "text": "[sardonic] Ha! Good luck with that. History suggests the cannon makes the law, not the treaty."
  },
  {
    "speaker": "Elena",
    "text": "You brought up the Scramble for Africa. That lasted thirty years."
  },
  {
    "speaker": "James",
    "text": "[conceding] And reshaped the world for a century. This will be different, perhaps less violent, but the divisions more permanent."
  },
  {
    "speaker": "Elena",
    "text": "The very definition of a new global hierarchy, then. And the scale is almost unimaginable."
  },
  {
    "speaker": "James",
    "text": "The race has already begun. China, the US, India. All planting flags, or preparing to."
  },
  {
    "speaker": "Elena",
    "text": "With very few rules that anyone truly respects."
  },
  {
    "speaker": "James",
    "text": "Only the rules of capability. And effective occupation."
  },
  {
    "speaker": "Elena",
    "text": "[clipped] Exactly. And that's what makes it so precarious for humanity."
  }
]