[
  {
    "speaker": "James",
    "text": "The US-Taiwan trade deal, February 2026. $250 billion in investment for American chip production. Tariffs at 15%. Unthinkable a decade ago, wouldn't you say?"
  },
  {
    "speaker": "Elena",
    "text": "Unthinkable? Perhaps. Necessary? I'm not so sure. It sounds suspiciously like protectionism."
  },
  {
    "speaker": "James",
    "text": "[dry] And what's wrong with that, Elena? For five centuries, every powerful nation built its strength on protected manufacturing. Free trade was the aberration."
  },
  {
    "speaker": "Elena",
    "text": "Come on. Globalisation brought cheaper goods, consumer choice. You can't just ditch that for… state factories."
  },
  {
    "speaker": "James",
    "text": "Cheaper goods, yes. But at what cost? We offshored everything, then discovered we couldn't make a surgical mask during a pandemic."
  },
  {
    "speaker": "Elena",
    "text": "That was an emergency. Not a reason to rewrite forty years of economic policy."
  },
  {
    "speaker": "James",
    "text": "[emphatic] The article calls it a 'strategic subsidy' — our 'free trade' was a Cold War tactic. We traded manufacturing jobs for military alliances."
  },
  {
    "speaker": "Elena",
    "text": "So, it wasn't about economic efficiency at all? Just geopolitics?"
  },
  {
    "speaker": "James",
    "text": "Precisely. And China weaponised that system. They systematically moved up the value chain, backed by state subsidies and IP theft."
  },
  {
    "speaker": "Elena",
    "text": "That's a convenient reading of the data, James. Many Western companies willingly went to China for cheap labour."
  },
  {
    "speaker": "James",
    "text": "And now we see the consequences. Remember \"Europe Rearms\"? The EU couldn't deliver a million artillery shells to Ukraine."
  },
  {
    "speaker": "Elena",
    "text": "Right. Capacity issues."
  },
  {
    "speaker": "James",
    "text": "Exactly. Europe's GDP is ten times Russia's, but it can't produce a fraction of Russia's military output. That's a direct result of deindustrialisation."
  },
  {
    "speaker": "Elena",
    "text": "Okay, that's... actually devastating. But you can't just mandate factories into existence."
  },
  {
    "speaker": "James",
    "text": "Hamilton did. In 1791. High tariffs, subsidies, infrastructure, recruiting skilled workers. America was the most protectionist economy for 150 years. Look what happened."
  },
  {
    "speaker": "Elena",
    "text": "But that was a different era. You can't compare 18th-century America to today's global economy."
  },
  {
    "speaker": "James",
    "text": "[amused] Friedrich List said free trade was \"kicking away the ladder\" — Britain did it, then told everyone else ladders were inefficient."
  },
  {
    "speaker": "Elena",
    "text": "So you're saying it's all just national self-interest, always has been?"
  },
  {
    "speaker": "James",
    "text": "Mostly. And now, technology is changing the calculus entirely."
  },
  {
    "speaker": "Elena",
    "text": "How so?"
  },
  {
    "speaker": "James",
    "text": "AI and robotics. The labour cost advantage is disappearing. A robot factory in Ohio costs roughly the same as one in Guangdong."
  },
  {
    "speaker": "Elena",
    "text": "Wait, really? That completely undercuts the whole 'cheap labour' argument for offshoring."
  },
  {
    "speaker": "James",
    "text": "[thoughtful] It does. If labour costs equalise, then proximity to market, supply chain resilience, and geopolitical stability become the deciding factors. We discussed this in our \"Robotics and Slavery\" piece."
  },
  {
    "speaker": "Elena",
    "text": "I hadn't thought of it that way. So, the economic case for offshoring just... evaporates?"
  },
  {
    "speaker": "James",
    "text": "Largely. Morgan Stanley predicts 2026 is an inflection point for American manufacturing transformation. Companies are investing in automation now, preparing for greenfield factories at home."
  },
  {
    "speaker": "Elena",
    "text": "Well... okay, that's harder to argue with than I expected. The pure economics are shifting."
  },
  {
    "speaker": "James",
    "text": "It's a return to the historical norm. A virtuous cycle: factories, skilled workers, innovation, new industries."
  },
  {
    "speaker": "Elena",
    "text": "But what about consumer prices? Will we just be paying more for everything?"
  },
  {
    "speaker": "James",
    "text": "Perhaps initially. But the 'cheap' Chinese goods had hidden costs: lost jobs, hollowed-out communities, strategic vulnerability. We're now paying those."
  },
  {
    "speaker": "Elena",
    "text": "I suppose so. Like our article on \"Crisis: The Decline of the West\" highlighted, the long-term costs often outweigh the short-term gains."
  },
  {
    "speaker": "James",
    "text": "Precisely. And nations that fail to rebuild? The article ends with a stark warning: late Rome. Wealthy on paper, dependent on others for everything essential."
  },
  {
    "speaker": "Elena",
    "text": "Outsourcing its military, its agriculture... becoming strategically vulnerable. It's a chilling parallel."
  },
  {
    "speaker": "James",
    "text": "Chilling, but accurate. The factories are coming back. The only question is which nations build them fast enough."
  },
  {
    "speaker": "Elena",
    "text": "And whether that leads to a new kind of economic rivalry. A less cooperative, more mercantilist world."
  },
  {
    "speaker": "James",
    "text": "Or a more resilient one. Perhaps both. History, as ever, rhymes."
  }
]