[
  {
    "speaker": "James",
    "text": "Angela Merkel, 2015. 'Wir schaffen das.' Three words that were, frankly, historically extraordinary. Not generous, mind you, but unprecedented."
  },
  {
    "speaker": "Elena",
    "text": "Unprecedented? Oh, come on, James. Europe has always been a crossroads. People move. It's human history."
  },
  {
    "speaker": "James",
    "text": "Moving is one thing. Uncontrolled mass migration, encouraged by the state, without cultural assimilation as a clear goal? That's what's unprecedented. Five millennia of civilisation say otherwise."
  },
  {
    "speaker": "Elena",
    "text": "Says who? The Sumerians? The Romans? They were hardly beacons of liberal democracy. Our values are different now."
  },
  {
    "speaker": "James",
    "text": "The article's point isn't about values. It's about statecraft. Sumerian city-states had legal categories for non-citizens. Egypt built border fortresses. They tracked every single foreigner."
  },
  {
    "speaker": "Elena",
    "text": "That's just xenophobia with an ancient accent, isn't it?"
  },
  {
    "speaker": "James",
    "text": "No, it was survival. Athens, the birthplace of democracy, restricted citizenship to those born to two Athenian parents. Aristotle, a genius, couldn't vote."
  },
  {
    "speaker": "Elena",
    "text": "So you're saying we should adopt Pericles' citizenship laws? You can't seriously be advocating that."
  },
  {
    "speaker": "James",
    "text": "I'm saying the historical default is control. Look at China. The Great Wall wasn't just military. It was a philosophical statement: civilisation ends here. Beyond this line are barbarians."
  },
  {
    "speaker": "Elena",
    "text": "And that's a model you admire? A wall against humanity?"
  },
  {
    "speaker": "James",
    "text": "It preserved Chinese identity for millennia. The periods when the Wall was porous, China was conquered or fragmented. History is quite clear on that, as our 'China Has Many Of The Characteristics Of An Emerging Colonial Power' piece often touches on."
  },
  {
    "speaker": "Elena",
    "text": "Okay, but China is China. Japan, then? Two hundred years of sakoku? No one in, no one out. That led to stagnation."
  },
  {
    "speaker": "James",
    "text": "Stagnation? The Edo period saw a cultural flowering. Kabuki, ukiyo-e, haiku. Urban sophistication. They emerged culturally cohesive and industrialised faster than anyone when they finally opened."
  },
  {
    "speaker": "Elena",
    "text": "That's a convenient reading of isolation. There were huge costs, too."
  },
  {
    "speaker": "James",
    "text": "Perhaps. But they controlled their destiny. The most relevant example, though, is Rome."
  },
  {
    "speaker": "Elena",
    "text": "Oh, here we go. The barbarians at the gate."
  },
  {
    "speaker": "James",
    "text": "Early Rome was ferociously exclusive with citizenship. It was a privilege. Then Caracalla, in AD 212, made everyone a citizen. If everyone's a citizen, no one is. Right?"
  },
  {
    "speaker": "Elena",
    "text": "That's a vast oversimplification of the fall of Rome. Economic collapse, political instability, climate change—"
  },
  {
    "speaker": "James",
    "text": "No, let me finish. The article clearly states that within two generations, the army was Germanic foederati. Loyal to their chiefs, not to Rome. The distinction between Roman and barbarian blurred. Odoacer, a Roman general, deposed the last emperor. It was a change of management, not a conquest."
  },
  {
    "speaker": "Elena",
    "text": "You're saying multiculturalism destroyed Rome? That's… pretty bleak."
  },
  {
    "speaker": "James",
    "text": "I'm saying the dilution of shared identity, combined with uncontrolled entry, weakened it fatally. The West's current approach is a fifty-year experiment. Started with the Hart-Celler Act in '65 in the US."
  },
  {
    "speaker": "Elena",
    "text": "Which Senator Kennedy promised wouldn't change the ethnic mix. He was just wrong."
  },
  {
    "speaker": "James",
    "text": "Wildly wrong. Foreign-born share went from 4.7% in 1970 to over 14% today. Europe's Gastarbeiter programmes were meant to be temporary. They didn't go home."
  },
  {
    "speaker": "Elena",
    "text": "Because they built lives, found communities. That's a human story, James, not just a policy failure."
  },
  {
    "speaker": "James",
    "text": "True. But the gap between what governments do and what citizens want has been constant for fifty years. In Britain, America, Germany. Publics want less immigration; governments ignore it."
  },
  {
    "speaker": "Elena",
    "text": "So, populist parties rise. That's the democratic system at work, however ugly."
  },
  {
    "speaker": "James",
    "text": "The data is the really uncomfortable part. Integration. Fiscal impact. Social trust."
  },
  {
    "speaker": "Elena",
    "text": "Go on."
  },
  {
    "speaker": "James",
    "text": "Integration? For some groups, fine. East Asians in the US, for example. But for others, like third-generation North Africans in France, unemployment is double the national average. Swedes from Somalia, Afghanistan, Iraq: employment rates below 40% after ten years."
  },
  {
    "speaker": "Elena",
    "text": "That's not just about culture. That's about discrimination, systemic barriers—"
  },
  {
    "speaker": "James",
    "text": "The OECD report suggests these are structural patterns that persist across generations. It's not just individual effort. The assumption of automatic integration is wrong for certain combinations."
  },
  {
    "speaker": "Elena",
    "text": "Hmm. Okay, I'll concede that certain integration challenges are proving more persistent than optimists hoped."
  },
  {
    "speaker": "James",
    "text": "And the fiscal equation? Danish Ministry of Finance: non-Western immigrants are a net fiscal cost of 33 billion kroner a year. Western immigrants are net contributors. Dutch Central Planning Bureau, UK Migration Advisory Committee—all say the same."
  },
  {
    "speaker": "Elena",
    "text": "That's a tough number. But surely there's a humanitarian argument? A moral imperative that transcends pure economics?"
  },
  {
    "speaker": "James",
    "text": "The article suggests that's a post-1965 invention. Historically, statecraft, not morality. And then there's Putnam."
  },
  {
    "speaker": "Elena",
    "text": "Putnam? The social trust guy? I know his work. He struggled to publish those findings, didn't he?"
  },
  {
    "speaker": "James",
    "text": "He did. He found ethnic diversity reduces social trust. Not just between groups, but within groups. People of all ethnicities trust their neighbours less, participate less, report lower life satisfaction."
  },
  {
    "speaker": "Elena",
    "text": "I don't want to agree with you on this, but the replication across multiple studies makes it harder to argue against than I'd like. It's not a comfortable finding."
  },
  {
    "speaker": "James",
    "text": "It implies rapid, large-scale demographic change has real costs to social cohesion. Costs policymakers refuse to acknowledge, to paraphrase our 'Crisis: Or An Explanation On The Origins Of The Decline Of The West' article."
  },
  {
    "speaker": "Elena",
    "text": "But what's the alternative? The Roman path, as the article calls it? Fragmentation and collapse? Or Japan's correction, building walls and shutting down? That's not a globalised future."
  },
  {
    "speaker": "James",
    "text": "Or the Singapore Model. Strictly economic contribution, cultural compatibility. No right to family reunification, no asylum path to settlement. Immigration as a tool of national strategy."
  },
  {
    "speaker": "Elena",
    "text": "That sounds incredibly harsh. Stripping away family reunification feels... inhuman. We can't reduce people to economic units."
  },
  {
    "speaker": "James",
    "text": "It's the historical norm for successful states. What's inhuman is ignoring the evidence and letting our societies fragment. The gates are still in our hands. The question is if we have the will to use them."
  },
  {
    "speaker": "Elena",
    "text": "But to what end? Just to preserve a static identity? I still believe there's a moral component to how a society treats those seeking refuge or a better life, beyond just its own survival."
  },
  {
    "speaker": "James",
    "text": "Perhaps. But history suggests that societies which prioritise that moral component over basic statecraft tend not to survive long enough to preach it to others."
  }
]