[
  {
    "speaker": "James",
    "text": "[dry] \"The energy revolution isn't about saving the planet, Elena. Nor national security. It's about pure economics.\""
  },
  {
    "speaker": "Elena",
    "text": "[frustrated] \"Oh, come on, James. That's a terribly cynical take. Are you really dismissing climate change *again*?\""
  },
  {
    "speaker": "James",
    "text": "\"History Future Now has previously stated we've missed that boat. The article makes it clear: arguing about climate change is a waste of time.\""
  },
  {
    "speaker": "Elena",
    "text": "\"So we just give up? That's not exactly a rallying cry for action, is it?\""
  },
  {
    "speaker": "James",
    "text": "\"It's realism. The main driver for solar is its cost. It's simply too cheap.\""
  },
  {
    "speaker": "Elena",
    "text": "\"But it's been heavily subsidised, hasn't it? That's hardly 'cheap' in a free market sense.\""
  },
  {
    "speaker": "James",
    "text": "[emphatic] \"That's changing. Rapidly. The raw material is silicon—sand. Manufacturing techniques are improving constantly.\""
  },
  {
    "speaker": "Elena",
    "text": "\"Even so, what about intermittency? The sun doesn't always shine when you need power.\""
  },
  {
    "speaker": "James",
    "text": "\"Irrelevant for the core problem it creates. Solar produces its peak output exactly when demand surges: midday.\""
  },
  {
    "speaker": "Elena",
    "text": "\"Okay, but that doesn't mean conventional power stations just… vanish.\""
  },
  {
    "speaker": "James",
    "text": "\"Their profits do. Think of the 'merit order' in electricity generation. Spot prices are set by the most expensive generator online.\""
  },
  {
    "speaker": "Elena",
    "text": "\"Right, so during peak demand, prices go up, and everyone profits.\""
  },
  {
    "speaker": "James",
    "text": "\"Exactly. That's where conventional generators make their money. But solar has zero fuel costs, almost zero marginal cost.\""
  },
  {
    "speaker": "Elena",
    "text": "\"So it always undercuts them.\""
  },
  {
    "speaker": "James",
    "text": "\"Always. Deutsche Bank analysts found solar PV was cutting peak electricity prices by up to 40%.\""
  },
  {
    "speaker": "Elena",
    "text": "[surprised] \"Forty percent? Wait, when did that happen?\""
  },
  {
    "speaker": "James",
    "text": "\"Germany, years ago. Utilities found it 'intolerable'. Enel, Italy's biggest utility, saw a one-third slump in earnings from generation.\""
  },
  {
    "speaker": "Elena",
    "text": "\"One-third? That's... actually devastating for their business model.\""
  },
  {
    "speaker": "James",
    "text": "\"It is. And it's not just the wholesale market. There's a second problem.\""
  },
  {
    "speaker": "Elena",
    "text": "\"You mean domestic rooftop solar? Eating into their retail profits?\""
  },
  {
    "speaker": "James",
    "text": "\"Yes. Households switching means fewer retail customers paying higher prices. The cost of grid maintenance gets spread across a smaller base.\""
  },
  {
    "speaker": "Elena",
    "text": "\"Leaving those without solar to pay more. Creating more incentive to switch. It's a death spiral for utilities, isn't it?\""
  },
  {
    "speaker": "James",
    "text": "[thoughtful] \"Precisely. A 'musical chairs' scenario, as the article puts it. The music stops eventually.\""
  },
  {
    "speaker": "Elena",
    "text": "\"But incumbents fight back. They have political influence. You said that yourself, even in 'Green Is Not Red, But Blue'.\""
  },
  {
    "speaker": "James",
    "text": "\"True. But against the falling costs of sand? Good luck. Planning permission for a new conventional power station takes 3-7 years.\""
  },
  {
    "speaker": "Elena",
    "text": "\"And solar is much quicker to deploy.\""
  },
  {
    "speaker": "James",
    "text": "\"Much. Does it make sense to build a new coal plant today if it'll be economically unviable within a few years of operation?\""
  },
  {
    "speaker": "Elena",
    "text": "\"No... I suppose not. You're saying the investment case collapses before it's even built.\""
  },
  {
    "speaker": "James",
    "text": "\"For companies like GE, who make those generators, their business has a finite life. The same for coal and gas companies.\""
  },
  {
    "speaker": "Elena",
    "text": "\"And then oil? You're going to tell me oil is next, aren't you?\""
  },
  {
    "speaker": "James",
    "text": "\"Electric vehicles are a perfect companion to solar. Parked all day, charging cheaply. This revolution will affect oil within a decade.\""
  },
  {
    "speaker": "Elena",
    "text": "\"Within a decade? I think that's wildly optimistic, frankly. There are billions of conventional cars in developing countries alone.\" "
  },
  {
    "speaker": "James",
    "text": "\"The trend is set. Remember when you called it a 'death spiral'? It applies to fossil fuels too.\""
  },
  {
    "speaker": "Elena",
    "text": "I don't want to agree with you on this, James, but the numbers, especially Enel's earnings slump, don't leave much room to manoeuvre. It’s... cold hard capitalism in action. That's a brutal reality."
  },
  {
    "speaker": "James",
    "text": "[amused] \"Indeed. As we often say, 'Green is not red, but blue'. Environmentalism driven by market forces, not ideology.\""
  },
  {
    "speaker": "Elena",
    "text": "\"So, the losers are anyone invested in the old system. And the winners are... pension funds owning solar farms.\""
  },
  {
    "speaker": "James",
    "text": "\"And industrial consumers enjoying cheaper peak power. The everyday person who installs panels, too.\""
  },
  {
    "speaker": "Elena",
    "text": "\"But what about grid stability? If everyone's generating their own, who pays for the balancing act, the infrastructure?\""
  },
  {
    "speaker": "James",
    "text": "\"A very good question. One that existing utilities are desperate to answer, because it's their last bastion of revenue.\""
  },
  {
    "speaker": "Elena",
    "text": "\"So it's not quite a clean sweep. There are still deep structural challenges ahead.\""
  },
  {
    "speaker": "James",
    "text": "\"Lingering challenges, yes. But the direction of travel is undeniable. The market has decided.\""
  },
  {
    "speaker": "Elena",
    "text": "\"Well, that's harder to argue with than I expected. But it's a brutal revolution, isn't it? Just pure efficiency, leaving whole industries stranded.\""
  },
  {
    "speaker": "James",
    "text": "\"History is full of such revolutions. The steam engine, the internal combustion engine. This is just the next one.\""
  },
  {
    "speaker": "Elena",
    "text": "\"And we're just... observing the wreckage.\""
  },
  {
    "speaker": "James",
    "text": "\"Or deciding where to stand when the music stops.\""
  }
]