{
  "slug": "are-europeans-fundamentally-racist",
  "title": "Are Europeans Fundamentally Racist?",
  "url": "https://www.historyfuturenow.com/articles/are-europeans-fundamentally-racist",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "This concept of a country being “full” is not a new one and Ecopop’s call echoes that of the flamboyantly gay Dutch politician Pim Fortuyn in 2001 and 2002 who claimed…",
      "link": "https://www.historyfuturenow.com/articles/are-europeans-fundamentally-racist",
      "full": "This concept of a country being “full” is not a new one and Ecopop’s call echoes that of the flamboyantly gay Dutch politician Pim Fortuyn in 2001 and 2002 who claimed… https://www.historyfuturenow.com/articles/are-europeans-fundamentally-racist"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Switzerland has a unique form of democracy which allows for referendums to be held on any issue so long as the proponents gather a minimum of 100,000 certified signatures supporting the referendum.",
        "Full article: https://www.historyfuturenow.com/articles/are-europeans-fundamentally-racist"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Switzerland has a unique form of democracy which allows for referendums to be held on any issue so long as the proponents gather a minimum of 100,000 certified signatures supporting the referendum.  The Ecopop group of environmentalists has recently gathered 120,700 certified signatures supporting their referendum demand: a cap on population growth via immigration.\n\nEcopop’s argument is that Switzerland’s population is getting too large – it has increased by 15% since 1990- and that the bulk of that 15% population increase has been due to immigration.  They argue that their views are not anti foreigner, but rather they are against the destruction of Switzerland’s countryside due to the increased urban sprawl caused by a larger population.\n\nThis concept of a country being “full” is not a new one and Ecopop’s call echoes that of the flamboyantly gay Dutch politician Pim Fortuyn in 2001 and 2002 who claimed that “Nederland is vol” (Netherlands is full) and called for an end to the Netherlands’ liberal immigration policies that had seen the population explode in the post World War 2 period, making it one of most densely populated country in the world.\n\nRead the full essay: https://www.historyfuturenow.com/articles/are-europeans-fundamentally-racist\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if Are Europeans Fundamentally Racist?"
    },
    "quote_card": {
      "platform": "both",
      "text": "With the collapse of Britain’s first empire in America, Britain looked east and south.",
      "char_count": 86
    }
  }
}