{
  "slug": "cassandra-time-to-give-up-on-predicting-climate-change",
  "title": "Cassandra: Time To Give Up On Predicting Climate Change?",
  "url": "https://www.historyfuturenow.com/articles/cassandra-time-to-give-up-on-predicting-climate-change",
  "part": "Natural Resources",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Most History Future Now readers will be familiar with Homer’s epic of the Iliad, written about 2,800 years ago.",
      "link": "https://www.historyfuturenow.com/articles/cassandra-time-to-give-up-on-predicting-climate-change",
      "full": "Most History Future Now readers will be familiar with Homer’s epic of the Iliad, written about 2,800 years ago. https://www.historyfuturenow.com/articles/cassandra-time-to-give-up-on-predicting-climate-change"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Most History Future Now readers will be familiar with Homer’s epic of the Iliad, written about 2,800 years ago.",
        "Full article: https://www.historyfuturenow.com/articles/cassandra-time-to-give-up-on-predicting-climate-change"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Most History Future Now readers will be familiar with Homer’s epic of the Iliad, written about 2,800 years ago. Few will have actually read the poem, most will have a vague idea about the plot and many will have seen the film Troy . They will have watched Achilles, played by the golden haired Brad Pitt, rush up the beach to attack the Trojan defenders. They will know of beautiful Helen, initially the wife of King Melaneus, whose abduction by Prince Paris of Troy (played by effete Orlando Bloom) gave King Agamemnon the pretext to launch a war against the city of Troy. They will know of Hector, the brave and sensible older brother of Paris (played by brooding Eric Bana), and will possibly remember that Peter O’Toole played Priam, the King of Troy. Most people who have seen the film, however, will have forgotten about Cassandra. An easy thing to do as she is only mentioned in the film and never appears on screen. This was a mistake by the filmmakers as Cassandra was one of the most interesting characters in the Iliad. She was the daughter of King Priam and was spectacularly beautiful, only outshone by Helen herself. In the poem, the god Apollo was so entranced by Cassandra's beauty that he gave her the gift of prophesy. That was the good news. The bad news was that she refused to have sex with the god and, in retaliation, Apollo cursed her and said that her prophesies would…\n\nRead the full essay: https://www.historyfuturenow.com/articles/cassandra-time-to-give-up-on-predicting-climate-change\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if Time To Give Up On Predicting Climate Change?"
    },
    "quote_card": {
      "platform": "both",
      "text": "Most people who have seen the film, however, will have forgotten about Cassandra.",
      "char_count": 81
    }
  }
}