{
  "slug": "crisis-or-an-explanation-on-the-origins-of-the-decline-of-the-west",
  "title": "Crisis: Or An Explanation On The Origins Of The Decline Of The West",
  "url": "https://www.historyfuturenow.com/articles/crisis-or-an-explanation-on-the-origins-of-the-decline-of-the-west",
  "part": "Global Balance of Power",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Christopher Marlowe’s play Doctor Faustus was written in 1592 and was based on an earlier German work about Dr Faustus, a talented German…",
      "link": "https://www.historyfuturenow.com/articles/crisis-or-an-explanation-on-the-origins-of-the-decline-of-the-west",
      "full": "Christopher Marlowe’s play Doctor Faustus was written in 1592 and was based on an earlier German work about Dr Faustus, a talented German… https://www.historyfuturenow.com/articles/crisis-or-an-explanation-on-the-origins-of-the-decline-of-the-west"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Christopher Marlowe’s play Doctor Faustus was written in 1592 and was based on an earlier German work about Dr Faustus, a talented German scholar at Wittenburg University who was frustrated by the limits of human knowledge.",
        "Full article: https://www.historyfuturenow.com/articles/crisis-or-an-explanation-on-the-origins-of-the-decline-of-the-west"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "The Faustian Bargain: 500 Years of Western Expansion and Retreat. Trade policy shifts from mercantilism to free trade and their consequences",
      "chart_title": "The Faustian Bargain: 500 Years of Western Expansion and Retreat",
      "image": "images/articles/crisis-or-an-explanation-on-the-origins-of-the-decline-of-the-west/chart-crisisChart1.png",
      "source": "Historical analysis by History Future Now"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Christopher Marlowe’s play Doctor Faustus was written in 1592 and was based on an earlier German work about Dr Faustus, a talented German scholar at Wittenburg University who was frustrated by the limits of human knowledge. Feeling that he understood everything humanly possible, he made a bargain with Lucifer that for 24 years he would have access to knowledge that had hereto been hidden from humanity. In return, he would give his soul to the devil. The devil lived up to his side of the bargain and, 24 years later, comes to claim Faustus’ soul. Faustus, realising his mistake, is horrified and begs for mercy from God and the devil. But it is too late and he is dragged off. His friends later find his body, torn to pieces. In 1992 the West signed its own Faustian bargain. Not exactly with the devil, but for a promise of unparalleled wealth and a monopoly of power over the entire world. In return for this bargain we would leave our economies and societies in ruin and usher in the possible end of the West’s dominance over the world that it had enjoyed since the 1500s. History Future Now looks at what happened. This article covers a lot of ground – 500 years of history ranging from the Age of Discovery to the Opium Wars; a geographical reach over the entire globe, from Edo to Constantinople and Beijing to Washington; economic thought, from mercantilism to free trade; regulation and deregulation; and the impact…\n\nRead the full essay: https://www.historyfuturenow.com/articles/crisis-or-an-explanation-on-the-origins-of-the-decline-of-the-west\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if Or An Explanation On The Origins Of The Decline Of The West?"
    },
    "quote_card": {
      "platform": "both",
      "text": "And so when the Soviet Union collapsed on Christmas Day 1991, the lesson that everybody learned was that big government socialism and communism had failed.",
      "char_count": 155
    }
  }
}