{
  "slug": "dealing-with-the-consequences-of-climate-chance-inaction-the-impact-of-food",
  "title": "Dealing With The Consequences Of Climate Change Inaction: The Impact Of Food",
  "url": "https://www.historyfuturenow.com/articles/dealing-with-the-consequences-of-climate-chance-inaction-the-impact-of-food",
  "part": "Natural Resources",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "It will be 10 billion in another two to three decades.",
      "link": "https://www.historyfuturenow.com/articles/dealing-with-the-consequences-of-climate-chance-inaction-the-impact-of-food",
      "full": "It will be 10 billion in another two to three decades. https://www.historyfuturenow.com/articles/dealing-with-the-consequences-of-climate-chance-inaction-the-impact-of-food"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In a previous article History Future Now admitted defeat: climate change is happening and there is no viable political solution which will enable us to stop it from getting worse.",
        "Full article: https://www.historyfuturenow.com/articles/dealing-with-the-consequences-of-climate-chance-inaction-the-impact-of-food"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "The Food Gap: Production Capacity vs Population. The world may only be able to feed 5 billion — but will have 10 billion mouths",
      "chart_title": "The Food Gap: Production Capacity vs Population",
      "image": "images/articles/dealing-with-the-consequences-of-climate-chance-inaction-the-impact-of-food/chart-foodChart1.png",
      "source": "FAO, UN WPP, article estimates"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "In a previous article History Future Now admitted defeat: climate change is happening and there is no viable political solution which will enable us to stop it from getting worse. Global average temperatures will rise beyond the 2 degrees that politicians have determined is the absolute maximum that it should be allowed to increase by. We need to stop worrying about how to prevent it from getting worse and start concentrating on what governments need to do to manage this new reality. In this article we will look at the impact of global and local food shortages, exacerbated by climate change, and how governments should respond. Since History Future Now is UK based, the article will have a UK focused slant. First, lets start with a basic understanding of the food situation we are in today and what we can expect over the next 25 years. The world’s population is now over 7.3 billion. It will be 10 billion in another two to three decades. In the meantime, our primary food production areas are in trouble. One third of global agriculture is irrigated using underground aquifer water, which is finite and will run out in 25 years . Soil quality is declining as it is depleted or concreted over in new urban developments. Fish stocks are 20% of what they were in the mid 1950s. Added to this, as countries get wealthier they want to eat more protein. This means that much of the food that is available will be…\n\nRead the full essay: https://www.historyfuturenow.com/articles/dealing-with-the-consequences-of-climate-chance-inaction-the-impact-of-food\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if the Impact Of Food?"
    },
    "quote_card": {
      "platform": "both",
      "text": "While many economists think that this is the wrong response to this kind of crisis, it is understandable why politicians react this way.",
      "char_count": 136
    }
  }
}