{
  "slug": "dont-confuse-what-is-legal-with-what-is-morally-right",
  "title": "Don't Confuse What Is Legal With What Is Morally Right",
  "url": "https://www.historyfuturenow.com/articles/dont-confuse-what-is-legal-with-what-is-morally-right",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "It was legal to have slaves in parts of the United States all the way up until 1865.",
      "link": "https://www.historyfuturenow.com/articles/dont-confuse-what-is-legal-with-what-is-morally-right",
      "full": "It was legal to have slaves in parts of the United States all the way up until 1865. https://www.historyfuturenow.com/articles/dont-confuse-what-is-legal-with-what-is-morally-right"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Most people think of themselves as being “law abiding” citizens.",
        "Full article: https://www.historyfuturenow.com/articles/dont-confuse-what-is-legal-with-what-is-morally-right"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Most people think of themselves as being “law abiding” citizens. People admonish those that break the law and feel that it is reasonable that transgressors should pay the consequences of crime. Broadly speaking, this makes sense. In most Western countries there is a strong correlation between what is legal and what is morally right. But make no mistake. What is legal or illegal is not necessarily the same as what is morally right or wrong. Here are three good examples of laws that we now find morally wrong: Slavery . It was legal to have slaves in parts of the United States all the way up until 1865. Today there is no doubt that banning this practice was the right moral thing to do. At the time, however, the southern Confederate states chose to secede from the Union rather than abolish slavery. The northern States then went to war in order to keep the Union intact – which was an illegal aggressive act which breached the sovereignty of the southern States. The North had no interest in making slavery illegal in the South, they just did not want the practice to spread beyond the South. It was only later in the Civil War that Lincoln explicitly tied the war effort to slave emancipation in the South. So the South seceded to maintain a morally repugnant system and the North went to war in violation of the legal right of the South. Breaking the law was the right moral thing to…\n\nRead the full essay: https://www.historyfuturenow.com/articles/dont-confuse-what-is-legal-with-what-is-morally-right\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "Don't Confuse What Is Legal With What Is Morally Right?"
    },
    "quote_card": {
      "platform": "both",
      "text": "It was legal to have slaves in parts of the United States all the way up until 1865.",
      "char_count": 84
    }
  }
}