{
  "slug": "emigration-colonies-of-the-mind-and-space",
  "title": "Emigration: Colonies Of The Mind And Space",
  "url": "https://www.historyfuturenow.com/articles/emigration-colonies-of-the-mind-and-space",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "In the modern world, migration, from mainly non-Western countries into Western countries, has accelerated to unprecedented levels with children of immigrants…",
      "link": "https://www.historyfuturenow.com/articles/emigration-colonies-of-the-mind-and-space",
      "full": "In the modern world, migration, from mainly non-Western countries into Western countries, has accelerated to unprecedented levels with children of immigrants… https://www.historyfuturenow.com/articles/emigration-colonies-of-the-mind-and-space"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Ever since our ancient ancestors walked out of Africa between 125,000 and 60,000 years ago humans have pushed themselves to explore and to emigrate to territories that would have been almost impossible to reach by the technology at the time.",
        "Full article: https://www.historyfuturenow.com/articles/emigration-colonies-of-the-mind-and-space"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Ever since our ancient ancestors walked out of Africa between 125,000 and 60,000 years ago humans have pushed themselves to explore and to emigrate to territories that would have been almost impossible to reach by the technology at the time.  Imagine how hard and dangerous it would be to adapt to living in the frozen tundra of the arctic north or to settle Pacific islands like Easter Island, thousands of miles from the nearest land.\n\nRecorded history shows that even when the planet was reasonably settled it did not stop peoples from continuing to emigrate from one territory to another, generally uninvited and unwelcome by the people who were already there.  Emigration became aggressive, whether you were a Mongol riding across the steppes into Europe or skirting the deserts into China, or a European sailing across the Atlantic to the Americas or a Bantu herding your cattle across the rivers, jungles and deserts into Southern Africa.\n\nIn the modern world, migration, from mainly non-Western countries into Western countries, has accelerated to unprecedented levels with children of immigrants frequently outnumbering children of locals in major cities, presaging a major demographic and cultural shift over the next 20 years.  How far will emigration go?\n\nRead the full essay: https://www.historyfuturenow.com/articles/emigration-colonies-of-the-mind-and-space\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if Colonies Of The Mind And Space?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The ultimate form of virtual reality is something similar to that portrayed in The Matrix: a virtual world so real that it is impossible to distinguish between the real world and the virtual world.",
      "char_count": 197
    }
  }
}