{
  "slug": "green-is-not-red-but-blue-environmentalism-and-the-mystery-of-right-wing-opposition",
  "title": "Green Is Not Red, But Blue: Environmentalism And The Mystery Of Right Wing Opposition",
  "url": "https://www.historyfuturenow.com/articles/green-is-not-red-but-blue-environmentalism-and-the-mystery-of-right-wing-opposition",
  "part": "Natural Resources",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "By 1992, with Reagan, Thatcher and the end of the Cold War, socialism and left wing thinking appeared to be dead.",
      "link": "https://www.historyfuturenow.com/articles/green-is-not-red-but-blue-environmentalism-and-the-mystery-of-right-wing-opposition",
      "full": "By 1992, with Reagan, Thatcher and the end of the Cold War, socialism and left wing thinking appeared to be dead. https://www.historyfuturenow.com/articles/green-is-not-red-but-blue-environmentalism-and-the-mystery-of-right-wing-opposition"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Conservatives are rightly suspicious of environmentalists.",
        "Full article: https://www.historyfuturenow.com/articles/green-is-not-red-but-blue-environmentalism-and-the-mystery-of-right-wing-opposition"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "The Political Alignment Shift on Environmentalism. How green politics moved from conservative market mechanisms to left-wing activism",
      "chart_title": "The Political Alignment Shift on Environmentalism",
      "image": "images/articles/green-is-not-red-but-blue-environmentalism-and-the-mystery-of-right-wing-opposition/chart-greenChart1.png",
      "source": "Historical analysis by History Future Now"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Conservatives are rightly suspicious of environmentalists. By 1992, with Reagan, Thatcher and the end of the Cold War, socialism and left wing thinking appeared to be dead. Conservatism was triumphant. Left of centre parties all around the world shifted heavily to the right to compensate, occupying positions that would have looked centrist or moderately right wing 10 years previously. This left true socialists and left-wingers out in the cold, looking for a reason to exist. Conveniently, the emerging ozone hole crisis of the mid / late 1980s gave them an outlet for their energies: environmentalism. To many socialists, environmentalism appeared to need solutions that socialists had developed previously. Big problems required big governmental responses; paternalism, where government intervention was needed to stop business from engaging in activities that hurt citizens; and in wealth redistribution where big ozone, and then CO2, emitting countries provided aid and credits to smaller countries. Like Athena born fully armed from Zeus’ forehead, environmentalism was born armed with the all the tools necessary to thrive out of the intellectual forehead of socialism. Up until the early 2000s, conservative thinking was so dominant and successful that it not only absorbed left wing political parties, such as Labour under Blair in the UK, and the Democrats under Clinton in the USA, that the socialist attributes of environmentalism could be ignored. The use of conservative “market based mechanisms” such as cap and trade for ozone management, emissions trading schemes for carbon dioxide reduction, and renewable obligation certificates for clean…\n\nRead the full essay: https://www.historyfuturenow.com/articles/green-is-not-red-but-blue-environmentalism-and-the-mystery-of-right-wing-opposition\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if Environmentalism And The Mystery Of Right Wing Opposition?"
    },
    "quote_card": {
      "platform": "both",
      "text": "Conveniently, the emerging ozone hole crisis of the mid / late 1980s gave them an outlet for their energies: environmentalism.",
      "char_count": 126
    }
  }
}