{
  "slug": "prisons-we-never-used-to-have-them-will-they-exist-in-the-future",
  "title": "Prisons: We Never Used To Have Them. Will They Exist In The Future?",
  "url": "https://www.historyfuturenow.com/articles/prisons-we-never-used-to-have-them-will-they-exist-in-the-future",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Prisons as we know them are relatively new and we can thank Jeremy Bentham’s philosophy of utilitarianism in the 19th century for the first…",
      "link": "https://www.historyfuturenow.com/articles/prisons-we-never-used-to-have-them-will-they-exist-in-the-future",
      "full": "Prisons as we know them are relatively new and we can thank Jeremy Bentham’s philosophy of utilitarianism in the 19th century for the first… https://www.historyfuturenow.com/articles/prisons-we-never-used-to-have-them-will-they-exist-in-the-future"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Prisons as we know them are relatively new and we can thank Jeremy Bentham’s philosophy of utilitarianism in the 19th century for the first modern prisons.",
        "Full article: https://www.historyfuturenow.com/articles/prisons-we-never-used-to-have-them-will-they-exist-in-the-future"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Prisons as we know them are relatively new and we can thank Jeremy Bentham’s philosophy of utilitarianism in the 19th century for the first modern prisons. Previously people had been locked up, in jails and dungeons, but these were typically holding areas for prisoners before they met their ultimate sentence, or sometimes for political prisoners too important to kill and too dangerous to let free. Bentham brought in the idea that prisons could be used as a place to reform prisoners before they were released back into society. Sentenced convicts had a selection of punishments. The death penalty was widespread for many crimes that appear petty today. Public humiliation in the form of stocks was another form of punishment. From the 1600s to the 1800s various European colonial powers used their colonies as dumping grounds for criminals and as a means to boost the population of areas that few people would freely migrate to. The loss of the American colonies caused a crisis in England with many prisoners who would have been deported ending up in prison hulks – decommissioned ships. What these punishments all had in common was that they did not involve locking people up for decades or for the rest of their lives. Now it is possible to argue that it is better to lock someone up for a crime rather than exile them to a far away country or finish them off dangling in the gallows. But these traditional punishments had another big advantage over the…\n\nRead the full essay: https://www.historyfuturenow.com/articles/prisons-we-never-used-to-have-them-will-they-exist-in-the-future\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if We Never Used To Have Them. Will They Exist In The Future?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The loss of the American colonies caused a crisis in England with many prisoners who would have been deported ending up in prison hulks – decommissioned ships.",
      "char_count": 159
    }
  }
}