{
  "slug": "the-silence-of-the-scribes-how-every-civilisation-that-controlled-speech-collapsed",
  "title": "The Silence Of The Scribes: How Every Civilisation That Controlled Speech Collapsed",
  "url": "https://www.historyfuturenow.com/articles/the-silence-of-the-scribes-how-every-civilisation-that-controlled-speech-collapsed",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Meta alone had restricted over 28,000 pieces of Indian content in the first half of 2025 following government requests.",
      "link": "https://www.historyfuturenow.com/articles/the-silence-of-the-scribes-how-every-civilisation-that-controlled-speech-collapsed",
      "full": "Meta alone had restricted over 28,000 pieces of Indian content in the first half of 2025 following government requests. https://www.historyfuturenow.com/articles/the-silence-of-the-scribes-how-every-civilisation-that-controlled-speech-collapsed"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In February 2026, the Indian government issued new regulations requiring social media platforms to remove content deemed \"unlawful\" within three hours of receiving a government order.",
        "In the fifth century BC, a small city on the Aegean peninsula produced more intellectual, artistic, and political innovation in a single century than most civilisations produce in a millennium.",
        "Sparta provides the counter-example.",
        "The Islamic Golden Age (roughly 750–1258 AD) provides one of history's most dramatic demonstrations of what happens when a civilisation embraces intellectual openness — and what happens when it stops.",
        "The Soviet Union represents the most thorough modern attempt to control information.",
        "Full article: https://www.historyfuturenow.com/articles/the-silence-of-the-scribes-how-every-civilisation-that-controlled-speech-collapsed"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Government Content Removal Requests to Major Platforms (2024). India, Turkey, and Russia lead the world in demanding platforms remove content — the modern equivalent of burning books",
      "chart_title": "Government Content Removal Requests to Major Platforms (2024)",
      "image": "images/articles/the-silence-of-the-scribes-how-every-civilisation-that-controlled-speech-collapsed/chart-scribesChart1.png",
      "source": "Google Transparency Report 2024; X Transparency Center 2024; Meta Transparency Reports"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Sparta provides the counter-example. The Spartans created perhaps the most controlled society in the ancient world. Every aspect of Spartan life was regulated by the state. Boys were taken from their families at age seven and subjected to a brutal military training regime (the agoge). Speech was controlled — the term \"laconic\" (from Laconia, the region around Sparta) literally means \"using few words.\" Foreigners were periodically expelled (xenelasia) to prevent contamination by outside ideas. Travel abroad was restricted. Innovation was discouraged. The Spartan constitution, attributed to the semi-mythical Lycurgus, was treated as sacred and essentially unchangeable.\n\nSparta produced formidable soldiers. It won the Peloponnesian War against Athens. But it produced virtually nothing else. No Spartan philosopher, poet, playwright, historian, scientist, or artist is remembered today. Sparta's contribution to human civilisation, beyond the military arts, is effectively zero.\n\nMore importantly, Sparta's rigidity made it unable to adapt. Its system depended on a large population of helots (serfs) who outnumbered Spartan citizens by as much as seven to one. When Spartan citizen numbers declined — because the system was so demanding that fewer families could meet the requirements for full citizenship — the entire structure became unsustainable. By the third century BC, Sparta had fewer than 1,000 full citizens and had become a military irrelevance. The society that had controlled everything could not control the one thing that mattered: its own demographic decline.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-silence-of-the-scribes-how-every-civilisation-that-controlled-speech-collapsed\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "How Every Civilisation That Controlled Speech Collapsed?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The Soviet Union collapsed in 1991 — not because it was invaded, but because it could no longer function.",
      "char_count": 105
    }
  }
}