{
  "slug": "the-immorality-of-climate-change-a-reflection-on-slavery-and-the-civil-war",
  "title": "The immorality of climate change, a reflection on slavery and the Civil War",
  "url": "https://www.historyfuturenow.com/articles/the-immorality-of-climate-change-a-reflection-on-slavery-and-the-civil-war",
  "part": "Natural Resources",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Why was the United States, the icon of freedom and liberty who had inspired the French revolution and the 1848 revolutions across…",
      "link": "https://www.historyfuturenow.com/articles/the-immorality-of-climate-change-a-reflection-on-slavery-and-the-civil-war",
      "full": "Why was the United States, the icon of freedom and liberty who had inspired the French revolution and the 1848 revolutions across… https://www.historyfuturenow.com/articles/the-immorality-of-climate-change-a-reflection-on-slavery-and-the-civil-war"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Today, few people look back upon African slavery in the Americas as a good thing.",
        "Full article: https://www.historyfuturenow.com/articles/the-immorality-of-climate-change-a-reflection-on-slavery-and-the-civil-war"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Today, few people look back upon African slavery in the Americas as a good thing. There are no rousing speeches defending slave owners rights over their property, or demands not just to maintain the institution of slavery within their own borders but also to expand slavery into neighbouring states. There are no armies of poor white men fighting to keep rich white men's dominion over black slaves in the hope that one day, they too might become rich white men lording it over their own field and house negroes. And yet a mere 150 years ago, in the United States, this morality existed and a great Civil War took place between the Northern and the Southern states. 150 years is not a long time. Photography, telegraphs, railroads and huge factories existed. Many of your grand or great grand parents would have been alive. The people who lived then were recognisably like ourselves, and yet millions of them did look upon African slavery as a good thing, and did fight to maintain it. This raises two interesting questions. First, how did their sense of morality allow them to think this way and second, if we project ourselves 150 years into the future will our grand and great grand children look back at the way we live in a similar mixture of fascination and horror? Will our management of the environment, global warming, fisheries collapse, species extinctions be equally vilified? African slavery grew gradually but by 1831 there was a widespread belief…\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-immorality-of-climate-change-a-reflection-on-slavery-and-the-civil-war\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if the immorality of climate change, a reflection on slavery and the Civil War?"
    },
    "quote_card": {
      "platform": "both",
      "text": "Will our management of the environment, global warming, fisheries collapse, species extinctions be equally vilified?",
      "char_count": 116
    }
  }
}