{
  "slug": "the-empty-cradle-bargain-why-your-decision-not-to-have-children-is-everyones-problem",
  "title": "The Empty Cradle Bargain: Why Falling Birth Rates Are Everyone's Problem",
  "url": "https://www.historyfuturenow.com/articles/the-empty-cradle-bargain-why-your-decision-not-to-have-children-is-everyones-problem",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "And some are in the middle of the most physically and emotionally gruelling process in modern medicine, wondering why it…",
      "link": "https://www.historyfuturenow.com/articles/the-empty-cradle-bargain-why-your-decision-not-to-have-children-is-everyones-problem",
      "full": "And some are in the middle of the most physically and emotionally gruelling process in modern medicine, wondering why it… https://www.historyfuturenow.com/articles/the-empty-cradle-bargain-why-your-decision-not-to-have-children-is-everyones-problem"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Picture a dinner party in any prosperous Western city.",
        "There is a concept in economics called the tragedy of the commons.",
        "They are structural, measurable, and in many cases getting worse.\n\n### Housing: The Foundational Barrier\n\nIn 1970, the average house in the United Kingdom cost approximately 3.6 times the average annual salary.",
        "There is another barrier — perhaps the most consequential of all — and it is one that modern society has conspired to keep quiet about.",
        "In 1970, there were approximately 5.3 workers per retiree across the OECD.",
        "Full article: https://www.historyfuturenow.com/articles/the-empty-cradle-bargain-why-your-decision-not-to-have-children-is-everyones-problem"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "The Arithmetic of Extinction. How 1.0 children per couple leads to population halving every generation",
      "chart_title": "The Arithmetic of Extinction",
      "image": "images/articles/the-empty-cradle-bargain-why-your-decision-not-to-have-children-is-everyones-problem/chart-cradleChart1.png",
      "source": "Mathematical projection: each generation = previous × (fertility rate ÷ 2)"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Before examining why this matters at civilisational scale, let us be honest about why so many people are not having children, or are having fewer than they say they want. The barriers are not imaginary. They are structural, measurable, and in many cases getting worse.\n\nIn 1970, the average house in the United Kingdom cost approximately 3.6 times the average annual salary. Today it costs roughly 8.3 times. In London, the ratio exceeds 12. In Sydney, 13. In Vancouver, 12. In Munich, 11. These are not marginal increases. They represent a fundamental restructuring of what young adults can afford.\n\nYou cannot raise three children in a one-bedroom flat. You struggle with two in a two-bedroom flat. Yet for millions of young couples in Western cities, a three-bedroom home — the bare minimum for a family of four — requires either inherited wealth, two high incomes, or a move to a town where neither partner can find work in their profession. Housing policy is fertility policy, whether governments acknowledge it or not.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-empty-cradle-bargain-why-your-decision-not-to-have-children-is-everyones-problem\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "Why Falling Birth Rates Are Everyone's Problem?"
    },
    "quote_card": {
      "platform": "both",
      "text": "But when every farmer does the same, the pasture collapses and every flock starves.",
      "char_count": 83
    }
  }
}