{
  "slug": "the-great-emptying-how-collapsing-birth-rates-will-reshape-power-politics-and-people",
  "title": "The Great Emptying: How Collapsing Birth Rates Will Reshape Power, Politics And People",
  "url": "https://www.historyfuturenow.com/articles/the-great-emptying-how-collapsing-birth-rates-will-reshape-power-politics-and-people",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "In a small town in southern Italy, a school closed last year.",
      "link": "https://www.historyfuturenow.com/articles/the-great-emptying-how-collapsing-birth-rates-will-reshape-power-politics-and-people",
      "full": "In a small town in southern Italy, a school closed last year. https://www.historyfuturenow.com/articles/the-great-emptying-how-collapsing-birth-rates-will-reshape-power-politics-and-people"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In a small town in southern Italy, a school closed last year.",
        "Full article: https://www.historyfuturenow.com/articles/the-great-emptying-how-collapsing-birth-rates-will-reshape-power-politics-and-people"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "The Global Fertility Collapse. Total fertility rates by country. The replacement rate of 2.1 is the minimum needed for a population to sustain itself. Most of the developed world is well below it.",
      "chart_title": "The Global Fertility Collapse",
      "image": "images/articles/the-great-emptying-how-collapsing-birth-rates-will-reshape-power-politics-and-people/chart-emptyChart1.png",
      "source": "World Bank, UN Population Division, national statistics offices (2023-2024)."
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "In a small town in southern Italy, a school closed last year. Not because of budget cuts or a scandal or a flood. Because there were no children left to attend it. The mayor posted a photograph on social media: a single classroom, chairs stacked on desks, a clock still ticking on the wall. The image went viral in Italy. But it should have gone viral everywhere, because that empty classroom is the future of the developed world.\n\nSomewhere in Seoul, a maternity ward has been converted into a geriatric unit. In rural Japan, there are now more adult nappies sold than baby nappies. In Spain, there are entire villages where the youngest resident is over sixty. In China, the government that once punished families for having a second child is now begging them to have a third. They are not having even one.\n\nThis is not a recession. It is not a cycle. It is not something that will bounce back. What you are about to read is the story of the most consequential change in human civilisation since the Industrial Revolution, and almost nobody in power is willing to talk honestly about where it leads. Because where it leads is uncomfortable for everyone: left, right, rich, poor, East and West alike.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-great-emptying-how-collapsing-birth-rates-will-reshape-power-politics-and-people\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "How Collapsing Birth Rates Will Reshape Power, Politics And People?"
    },
    "quote_card": {
      "platform": "both",
      "text": "This is not the first time a great civilisation has confronted a fertility crisis.",
      "char_count": 82
    }
  }
}