{
  "slug": "the-last-drop-why-every-civilisation-that-ran-out-of-water-collapsed",
  "title": "The Last Drop: Why Every Civilisation That Ran Out of Water Collapsed",
  "url": "https://www.historyfuturenow.com/articles/the-last-drop-why-every-civilisation-that-ran-out-of-water-collapsed",
  "part": "Natural Resources",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "In January 2018, the city of Cape Town announced that it was ninety days away from running out of water.",
      "link": "https://www.historyfuturenow.com/articles/the-last-drop-why-every-civilisation-that-ran-out-of-water-collapsed",
      "full": "In January 2018, the city of Cape Town announced that it was ninety days away from running out of water. https://www.historyfuturenow.com/articles/the-last-drop-why-every-civilisation-that-ran-out-of-water-collapsed"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In January 2018, the city of Cape Town announced that it was ninety days away from running out of water.",
        "In 1957, the German-American historian Karl Wittfogel published Oriental Despotism, a sprawling and controversial work that proposed what became known as the \"hydraulic hypothesis.\" Wittfogel's argument was deceptively simple: large-scale irrigation requires centralised…",
        "Founded by Sargon of Akkad around 2334 BC, it was arguably the world's first empire, unifying the Sumerian city-states under a single authority that stretched from the Persian Gulf to the Mediterranean.",
        "The comforting assumption of the modern era is that technology has liberated us from the ancient dependency on rainfall and rivers.",
        "Under the 1959 Nile Waters Agreement (which Sudan co-signed but upstream nations did not), Egypt claims 55.5 billion cubic metres of the river's annual flow.",
        "Full article: https://www.historyfuturenow.com/articles/the-last-drop-why-every-civilisation-that-ran-out-of-water-collapsed"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Global Freshwater Withdrawal vs. Renewable Supply (1900–2050). Humanity is drawing down its water reserves faster than nature can replenish them",
      "chart_title": "Global Freshwater Withdrawal vs. Renewable Supply (1900–2050)",
      "image": null,
      "source": "FAO AQUASTAT; UN World Water Development Report 2024"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "If water management built civilisations, then the loss of water destroyed them. The archaeological record is littered with the remains of societies that thrived for centuries and then, within a few generations, vanished. In a striking number of cases, the collapse correlates with a disruption to the water supply — whether from drought, over-irrigation, salinisation, or the failure of hydraulic infrastructure. **The Akkadian Empire** provides the earliest well-documented case. Founded by Sargon of Akkad around 2334 BC, it was arguably the world's first empire, unifying the Sumerian city-states under a single authority that stretched from the Persian Gulf to the Mediterranean. It lasted barely a century. Around 2200 BC, the empire disintegrated with a speed that has puzzled historians for generations. Archaeological evidence from Tell Leilan in modern Syria shows that the city was abruptly abandoned — not sacked, not burned, but simply left empty, with a thick layer of wind-blown dust accumulating over the ruins (Weiss et al., 1993). The explanation came from climate science. Peter deMenocal, analysing deep-sea sediment cores from the Gulf of Oman, demonstrated that the period around 2200 BC coincided with a sharp increase in wind-borne dust — a proxy for severe arid conditions across Mesopotamia. The drought was not a brief dry spell. It lasted approximately three hundred years (deMenocal, 2001). The irrigation canals that had sustained the Akkadian agricultural system could not function without river water, and the rivers depended on rainfall in the headwaters. When the rain stopped, the canals dried up,…\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-last-drop-why-every-civilisation-that-ran-out-of-water-collapsed\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "Why Every Civilisation That Ran Out of Water Collapsed?"
    },
    "quote_card": {
      "platform": "both",
      "text": "Civilisations that lose control of water — through climate change, over-extraction, infrastructure failure, or sheer negligence — collapse.",
      "char_count": 139
    }
  }
}