{
  "slug": "the-wests-romance-with-free-trade-is-over-why",
  "title": "The West’s romance with Free Trade is ending. Why?",
  "url": "https://www.historyfuturenow.com/articles/the-wests-romance-with-free-trade-is-over-why",
  "part": "Global Balance of Power",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Early examples include the Bristol Society of Merchant Venturers, who paid for John Cabot (an Italian) to sail to Newfoundland in 1497, the Virginia Company…",
      "link": "https://www.historyfuturenow.com/articles/the-wests-romance-with-free-trade-is-over-why",
      "full": "Early examples include the Bristol Society of Merchant Venturers, who paid for John Cabot (an Italian) to sail to Newfoundland in 1497, the Virginia Company… https://www.historyfuturenow.com/articles/the-wests-romance-with-free-trade-is-over-why"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Donald Trump is marching the US into a trade war with China.",
        "Early examples include the Bristol Society of Merchant Venturers, who paid for John Cabot (an Italian) to sail to Newfoundland in 1497, the Virginia Company (memorialised by the Disney cartoon Pocohantas) who had exclusive rights to large chunks of the eastern seaboard of…",
        "The answer is the Industrial Revolution.",
        "It was revitalised after the collapse of the Soviet Union, in 1989, when Western companies rushed into former soviet block markets and quickly crushed the local competition.",
        "Full article: https://www.historyfuturenow.com/articles/the-wests-romance-with-free-trade-is-over-why"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "The answer is the Industrial Revolution. Britain’s mercantilist experience had created a huge amount of surplus wealth for Britain. By the late 1700s and the early 1800s this wealth was being used to back scientists and tinkerers in the developments of new labour saving machines. Within a remarkably short period of time Britain, who led the Industrial Revolution, was able to produce goods that were cheaper, better and in far greater quantity than those produced by traditional home-based workshops. If you can produce something that is cheaper, better and in greater quantities than anyone else you essentially have no competition. And if you have no competition you are a monopoly. So if Britain could compete, and win, against everyone else the only thing that stopped Britain from selling goods all over the world the was the fact that other countries restricted the imports of British goods. That is why Britain shifted to being militantly pro free trade; free trade was nothing more than an extension of mercantilism. \"..free trade was nothing more than an extension of mercantilism.\" “Militantly” is not a figure of speech. Britain used force to break into closed markets. For example, China had restricted access by the British, and other European countries, to the Chinese market prior to the 1840s. China was wary of European influences and had little interest in any products that the West had to offer, other than silver. As a result, European countries ran a massive trade deficit with China. Running permanent deficits…\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-wests-romance-with-free-trade-is-over-why\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "The West’s romance with Free Trade is ending. Why?"
    },
    "quote_card": {
      "platform": "both",
      "text": "It was revitalised after the collapse of the Soviet Union, in 1989, when Western companies rushed into former soviet block markets and quickly crushed the local competition.",
      "char_count": 173
    }
  }
}