{
  "slug": "the-great-offshoring-how-the-worlds-factory-moved-east",
  "title": "The Great Offshoring: How the World's Factory Moved East",
  "url": "https://www.historyfuturenow.com/articles/the-great-offshoring-how-the-worlds-factory-moved-east",
  "part": "Global Balance of Power",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Here is a number that should stop you cold: in 1990, the G7 nations produced roughly two-thirds of everything manufactured on Earth.",
      "link": "https://www.historyfuturenow.com/articles/the-great-offshoring-how-the-worlds-factory-moved-east",
      "full": "Here is a number that should stop you cold: in 1990, the G7 nations produced roughly two-thirds of everything manufactured on Earth. https://www.historyfuturenow.com/articles/the-great-offshoring-how-the-worlds-factory-moved-east"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Here is a number that should stop you cold: in 1990, the G7 nations produced roughly two-thirds of everything manufactured on Earth.",
        "A new pool of roughly 1.5 billion workers had suddenly entered the global labour market.",
        "If there is a single date that marks the death of the old manufacturing order, it is 11 December 2001 — the day China formally acceded to the World Trade Organisation.",
        "It was called the Smile Curve, and it was first proposed by Stan Shih, the founder of Acer, in 1992.",
        "Manufacturing as a share of GDP in the United Kingdom fell from 16.5% in 1990 to approximately 8.5% in 2024.",
        "Full article: https://www.historyfuturenow.com/articles/the-great-offshoring-how-the-worlds-factory-moved-east"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "The Great Crossover: G7 vs Emerging Asia Share of Global Manufacturing. Percentage of global manufacturing value added held by the G7 nations versus Emerging Asia (China, India, ASEAN)",
      "chart_title": "The Great Crossover: G7 vs Emerging Asia Share of Global Manufacturing",
      "image": "images/articles/the-great-offshoring-how-the-worlds-factory-moved-east/chart-offshoringChart1.png",
      "source": "UNIDO Industrial Statistics Database; World Bank National Accounts"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "If there is a single date that marks the death of the old manufacturing order, it is 11 December 2001 — the day China formally acceded to the World Trade Organisation.\n\nBefore WTO membership, Western companies considering Chinese production faced genuine uncertainty. Tariffs could change without warning. Intellectual property protections were notional at best. The rules of the game were subject to the whims of provincial officials. Many companies dipped a toe in but kept their core production at home.\n\nWTO accession changed the calculus overnight. China now operated under a rules-based trading system with predictable tariffs, dispute resolution mechanisms, and — crucially — Most Favoured Nation status with virtually every major economy. The risk premium evaporated. The floodgates opened.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-great-offshoring-how-the-worlds-factory-moved-east\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "How the World's Factory Moved East?"
    },
    "quote_card": {
      "platform": "both",
      "text": "Yet here is the paradox that the data reveals with brutal clarity: Western manufacturing output did not collapse.",
      "char_count": 113
    }
  }
}