{
  "slug": "the-unintended-consequences-of-war-how-the-loss-of-young-men-transformed-womens-roles-in-society-and-ushered-in-the-welfare-state",
  "title": "The Unintended Consequences of War: How the Loss of Young Men Transformed Women's Roles in Society and ushered in the Welfare State",
  "url": "https://www.historyfuturenow.com/articles/the-unintended-consequences-of-war-how-the-loss-of-young-men-transformed-womens-roles-in-society-and-ushered-in-the-welfare-state",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Throughout history, war has left an indelible mark on society, transforming…",
      "link": "https://www.historyfuturenow.com/articles/the-unintended-consequences-of-war-how-the-loss-of-young-men-transformed-womens-roles-in-society-and-ushered-in-the-welfare-state",
      "full": "Throughout history, war has left an indelible mark on society, transforming… https://www.historyfuturenow.com/articles/the-unintended-consequences-of-war-how-the-loss-of-young-men-transformed-womens-roles-in-society-and-ushered-in-the-welfare-state"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Throughout history, war has left an indelible mark on society, transforming the lives of those who survive and reshaping the roles of both men and women.",
        "Full article: https://www.historyfuturenow.com/articles/the-unintended-consequences-of-war-how-the-loss-of-young-men-transformed-womens-roles-in-society-and-ushered-in-the-welfare-state"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Estimated Male Deaths by Major Conflict. Total military/male deaths in millions across six centuries of warfare",
      "chart_title": "Estimated Male Deaths by Major Conflict",
      "image": "images/articles/the-unintended-consequences-of-war-how-the-loss-of-young-men-transformed-womens-roles-in-society-and-ushered-in-the-welfare-state/chart-warChart1.png",
      "source": "Various historical sources; ranges shown as midpoint estimates"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Throughout history, war has left an indelible mark on society, transforming the lives of those who survive and reshaping the roles of both men and women. While the devastating impact of conflict on the battlefield is well-documented, the true extent of war's influence on society, particularly in relation to the loss of young men and the subsequent changes in women's roles, is often overlooked.\n\nIn this article, History Future Now argues that the staggering loss of young male lives in major conflicts, spanning from the Thirty Years' War to World War II, has had far-reaching consequences that extend beyond the battlefield. These losses have forced women to step into roles traditionally occupied by men, both in the workplace and in the political arena, while also compelling the state to take on the responsibilities of the male provider.\n\nAs a result, the very fabric of society has been transformed, leading to the rise of the modern welfare state and a fundamental shift in the traditional roles of men and women. The impact of these changes are vast and complex, affecting everything from individual autonomy to the traditional family structure.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-unintended-consequences-of-war-how-the-loss-of-young-men-transformed-womens-roles-in-society-and-ushered-in-the-welfare-state\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "How the Loss of Young Men Transformed Women's Roles in Society and ushered in the Welfare State?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The First World War was a catastrophe for Europe, a cataclysm that destroyed a civilisation and set the stage for the even greater horrors of the Second World War.",
      "char_count": 163
    }
  }
}