{
  "slug": "the-new-oil-why-the-race-for-critical-minerals-will-define-the-21st-century",
  "title": "The New Oil: Why the Race for Critical Minerals Will Define the 21st Century",
  "url": "https://www.historyfuturenow.com/articles/the-new-oil-why-the-race-for-critical-minerals-will-define-the-21st-century",
  "part": "Natural Resources",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "On 1 July 2023, the People's Republic of China imposed export controls on gallium and germanium — two elements that most Western…",
      "link": "https://www.historyfuturenow.com/articles/the-new-oil-why-the-race-for-critical-minerals-will-define-the-21st-century",
      "full": "On 1 July 2023, the People's Republic of China imposed export controls on gallium and germanium — two elements that most Western… https://www.historyfuturenow.com/articles/the-new-oil-why-the-race-for-critical-minerals-will-define-the-21st-century"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 On 1 July 2023, the People's Republic of China imposed export controls on gallium and germanium — two elements that most Western policymakers could not have identified on the periodic table, let alone located in a supply chain.",
        "When King Leopold II of Belgium acquired the Congo Free State in 1885, he did so as a personal possession — not a Belgian colony, but a private estate roughly seventy-six times the size of Belgium itself.",
        "An electric vehicle requires 80 kilogrammes — four times as much — plus lithium, cobalt, nickel, manganese, and graphite for the battery, and rare earth elements for the permanent magnets in the motor (IEA, 2021).",
        "Deng Xiaoping reportedly observed in 1992 that \"the Middle East has oil, China has rare earths.\" Whether the quotation is apocryphal or not — and its provenance is debated — the sentiment was genuine.",
        "The European Union passed the Critical Raw Materials Act in 2024, which sets targets for domestic extraction (10% of annual consumption), processing (40%), and recycling (25%) by 2030.",
        "Full article: https://www.historyfuturenow.com/articles/the-new-oil-why-the-race-for-critical-minerals-will-define-the-21st-century"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "The energy transition — the shift from fossil fuels to renewable energy, electric vehicles, and battery storage — is the largest industrial transformation since electrification. It is also, by a considerable margin, the most mineral-intensive. A conventional car requires roughly 20 kilogrammes of copper. An electric vehicle requires 80 kilogrammes — four times as much — plus lithium, cobalt, nickel, manganese, and graphite for the battery, and rare earth elements for the permanent magnets in the motor (IEA, 2021). An offshore wind turbine requires approximately 8 tonnes of copper, 2 tonnes of rare earths, and hundreds of tonnes of steel (World Bank, 2020). Solar panels require silicon, silver, and increasingly tellurium and indium for thin-film technologies.\n\nThe International Energy Agency estimates that achieving the Paris Agreement's climate targets would require a quadrupling of mineral inputs by 2040 compared to 2020 levels (IEA, 2021). Lithium demand alone would need to increase by over forty times. Cobalt and nickel by roughly twenty times. Copper demand would need to double by 2035 — and the world has not opened a major new copper mine in over a decade.\n\nHere is where these minerals come from, and why that matters.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-new-oil-why-the-race-for-critical-minerals-will-define-the-21st-century\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "Why the Race for Critical Minerals Will Define the 21st Century?"
    },
    "quote_card": {
      "platform": "both",
      "text": "By 1914, Winston Churchill had converted the Royal Navy from coal to oil, making Persian petroleum a matter of national survival.",
      "char_count": 129
    }
  }
}