{
  "slug": "the-locked-gate-how-the-west-priced-its-children-out-of-existence",
  "title": "The Locked Gate: How the West Priced Its Children Out of Existence",
  "url": "https://www.historyfuturenow.com/articles/the-locked-gate-how-the-west-priced-its-children-out-of-existence",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "In Seoul, a couple earning the median household income must save every penny for eighteen years before they can afford a flat — and that is…",
      "link": "https://www.historyfuturenow.com/articles/the-locked-gate-how-the-west-priced-its-children-out-of-existence",
      "full": "In Seoul, a couple earning the median household income must save every penny for eighteen years before they can afford a flat — and that is… https://www.historyfuturenow.com/articles/the-locked-gate-how-the-west-priced-its-children-out-of-existence"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 The average house in England now costs 8.9 times the average annual salary (ONS, 2024).",
        "In England, the Enclosure Acts between 1750 and 1860 privatised roughly 6.8 million acres of common land — about a fifth of England's total area (Allen, 1992).",
        "The United Kingdom's Green Belt policy, introduced in 1947, prevents development on approximately 1.6 million hectares of land surrounding major cities — an area larger than Northern Ireland (CPRE, 2023).",
        "In the United Kingdom, a 2023 YouGov survey found that 38% of adults aged 18–34 who did not have children cited housing costs as a primary reason.",
        "In England, approximately 65% of adults own their own home (English Housing Survey, 2023).",
        "Full article: https://www.historyfuturenow.com/articles/the-locked-gate-how-the-west-priced-its-children-out-of-existence"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "If the pattern is ancient, the contemporary version has distinguishing features. Housing in the developed world did not become unaffordable because of a single cause. It became unaffordable because of five causes operating simultaneously, each reinforcing the others in a system that nobody designed but everybody with property benefits from. **Restrictive planning.** The United Kingdom's Green Belt policy, introduced in 1947, prevents development on approximately 1.6 million hectares of land surrounding major cities — an area larger than Northern Ireland (CPRE, 2023). The policy was designed to prevent urban sprawl and preserve countryside. Its actual effect has been to create an artificial scarcity of buildable land near centres of employment, driving up the price of what remains. A hectare of agricultural land in England costs approximately £21,000. The same hectare with planning permission for residential development costs £6.9 million — a 328-fold increase that reflects nothing about the land's productive value and everything about regulatory constraint (Savills, 2024). NIMBYism — the organised resistance of existing homeowners to new development near their properties — operates as the enforcement mechanism. Every rejected planning application is a vote to keep housing scarce and prices high. The problem is not uniquely British. San Francisco added 53,000 jobs between 2012 and 2017 but permitted only 12,000 new housing units (Glaeser, 2020). Toronto's Greenbelt restricts development on 800,000 hectares around the city. Auckland's urban boundary was so tight that the average section price tripled between 2000 and 2016, until New Zealand's government overrode local planning restrictions…\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-locked-gate-how-the-west-priced-its-children-out-of-existence\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "How the West Priced Its Children Out of Existence?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The revolution, when it came, was precipitated not by ideology but by fiscal crisis: the state could no longer fund itself from a tax base it had spent a century impoverishing (Doyle, 2001).",
      "char_count": 190
    }
  }
}