{
  "slug": "the-gates-of-nations-how-every-civilisation-in-history-controlled-immigration-until-the-west-stopped",
  "title": "The Gates of Nations: How Every Civilisation in History Controlled Immigration — Until the West Stopped",
  "url": "https://www.historyfuturenow.com/articles/the-gates-of-nations-how-every-civilisation-in-history-controlled-immigration-until-the-west-stopped",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "The idea that a nation should accept large numbers of culturally distinct foreigners as a matter of…",
      "link": "https://www.historyfuturenow.com/articles/the-gates-of-nations-how-every-civilisation-in-history-controlled-immigration-until-the-west-stopped",
      "full": "The idea that a nation should accept large numbers of culturally distinct foreigners as a matter of… https://www.historyfuturenow.com/articles/the-gates-of-nations-how-every-civilisation-in-history-controlled-immigration-until-the-west-stopped"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In 2015, Angela Merkel stood before the cameras and said three words that will define her legacy more than any other act of her chancellorship: Wir schaffen das — we can manage this.",
        "The Sumerian city-states (c. 3500–2000 BC) had specific legal categories for non-citizens, who were barred from owning land, holding office, or participating in religious rites.",
        "No civilisation's experience with immigration is more relevant to the modern West than Rome's, because no civilisation's trajectory more closely mirrors our own.\n\n### The Early Republic: Citizenship as Fortress\n\nEarly Rome was ferociously exclusive.",
        "It is the product of a single generation's policy decisions, made between approximately 1948 and 1975, and it reversed millennia of practice.\n\n### The United States: From Restriction to Revolution\n\nThe United States, often presented as a \"nation of immigrants,\" was for…",
        "The debate about immigration is often conducted in moral terms — compassion versus cruelty, openness versus bigotry.",
        "Full article: https://www.historyfuturenow.com/articles/the-gates-of-nations-how-every-civilisation-in-history-controlled-immigration-until-the-west-stopped"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Foreign-Born Population Share: US, UK, Germany, France (1900–2030). After decades of restriction, Western nations opened their borders from the 1960s onward — a historically unprecedented shift",
      "chart_title": "Foreign-Born Population Share: US, UK, Germany, France (1900–2030)",
      "image": "images/articles/the-gates-of-nations-how-every-civilisation-in-history-controlled-immigration-until-the-west-stopped/chart-gatesChart1.png",
      "source": "UN Population Division; Migration Policy Institute; national census data. 2025–2030 projected."
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "No civilisation's experience with immigration is more relevant to the modern West than Rome's, because no civilisation's trajectory more closely mirrors our own.\n\nEarly Rome was ferociously exclusive. Citizenship was restricted to freeborn Romans. The *ius civitatis* — the right of citizenship — was the most jealously guarded privilege in the ancient world. It conferred legal protections, voting rights, access to public land, and exemption from certain taxes and punishments. It could not be bought. It could only be inherited or, in rare cases, granted by the Senate for extraordinary service.\n\nRome's Italian allies fought a war — the Social War of 91–88 BC — specifically to obtain Roman citizenship. The fact that they had to fight a war to get it tells you everything about how Rome valued it.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-gates-of-nations-how-every-civilisation-in-history-controlled-immigration-until-the-west-stopped\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "How Every Civilisation in History Controlled Immigration — Until the West Stopped?"
    },
    "quote_card": {
      "platform": "both",
      "text": "Every civilisation that stopped — the late Roman Empire, the late Ottoman Empire — paid the price in fragmentation, loss of identity, and eventual collapse.",
      "char_count": 156
    }
  }
}