{
  "slug": "the-builders-are-dying-how-the-populations-that-made-the-modern-world-are-disappearing",
  "title": "The Builders Are Dying: How the Populations That Made the Modern World Are Disappearing — And What Happens Next",
  "url": "https://www.historyfuturenow.com/articles/the-builders-are-dying-how-the-populations-that-made-the-modern-world-are-disappearing",
  "part": "Society",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "In 2018, the Swiss alpine village of Albinen made international headlines by offering families 25,000 Swiss francs per…",
      "link": "https://www.historyfuturenow.com/articles/the-builders-are-dying-how-the-populations-that-made-the-modern-world-are-disappearing",
      "full": "In 2018, the Swiss alpine village of Albinen made international headlines by offering families 25,000 Swiss francs per… https://www.historyfuturenow.com/articles/the-builders-are-dying-how-the-populations-that-made-the-modern-world-are-disappearing"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In 2018, the Swiss alpine village of Albinen made international headlines by offering families 25,000 Swiss francs per child to move there.",
        "For a population to sustain itself, women must bear an average of 2.1 children — one to replace the mother, one the father, and a fraction to account for mortality before reproductive age.",
        "Civilisation is not a birthright.",
        "### Civilisation as Cultural Inheritance\n\nThe critical insight is that civilisation is not carried in blood.",
        "Japan — the nation most advanced in its demographic decline — has the highest robot density in the world: 399 industrial robots per 10,000 manufacturing workers, compared to 285 in Germany and 255 in the United States.",
        "Full article: https://www.historyfuturenow.com/articles/the-builders-are-dying-how-the-populations-that-made-the-modern-world-are-disappearing"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "The Builder Premium: % of Global Achievements vs. % of World Population. European-heritage and East Asian populations are ~21% of the world but account for 87–95% of major scientific prizes, 71% of manufacturing, and 93% of shipbuilding.",
      "chart_title": "The Builder Premium: % of Global Achievements vs. % of World Population",
      "image": "images/articles/the-builders-are-dying-how-the-populations-that-made-the-modern-world-are-disappearing/chart-buildersChart1.png",
      "source": "Nobel Committee, IMU, ACM, World Bank, Clarksons Research, WIPO — cumulative through 2024"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Civilisation is not a birthright. It is an inheritance — a body of knowledge, institutions, and practices that must be actively transmitted from one generation to the next. When the chain of transmission breaks, the inheritance is lost. Libraries burn. Skills die with their holders. Institutions hollow out. The Romans knew how to build aqueducts that supplied fresh water to a million people over distances of ninety kilometres using nothing but gravity and precision stonework. After Rome fell, nobody knew how to fix them. It took a thousand years before European cities again had reliable water supply. The modern world's inheritance is overwhelmingly the product of two civilisational traditions: European and East Asian. This is not a claim of inherent superiority — this site has argued at length that the [rise of the West was based substantially on luck](https://www.historyfuturenow.com/articles/the-rise-of-the-west-was-based-on-luck-that-has-run-out). It is a factual accounting of who designed and built the systems on which eight billion people now depend. **The European record.** The scientific revolution — Copernicus, Galileo, Newton, Kepler. Germ theory: Pasteur and Koch. Antibiotics: Fleming. The periodic table: Mendeleev. Electromagnetism: Faraday, Maxwell, Tesla. Nuclear physics: Rutherford, Bohr, Fermi, Einstein. Evolution: Darwin. Genetics: Mendel. Computing: Babbage, Turing, von Neumann. Through 2024, roughly 87% of all Nobel Prizes in the sciences have gone to European-heritage laureates. The Fields Medal: 84%. The Turing Award: 88%. The Abel Prize: 100%. Charles Murray's *Human Accomplishment* catalogued every significant scientific breakthrough between 800 BC and 1950 using multiple independent historiographies: European and European-diaspora populations produced…\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-builders-are-dying-how-the-populations-that-made-the-modern-world-are-disappearing\n\n#Society #Demographics #Culture #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Society",
        "#Demographics",
        "#Culture",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "How the Populations That Made the Modern World Are Disappearing — And What Happens Next?"
    },
    "quote_card": {
      "platform": "both",
      "text": "By 2013, the population had collapsed to 680,000 — a 63% decline — and the city filed the largest municipal bankruptcy in American history.",
      "char_count": 139
    }
  }
}