{
  "slug": "the-rise-of-the-west-was-based-on-luck-that-has-run-out",
  "title": "The Rise of the West Was Based on Luck. That Has Run Out.",
  "url": "https://www.historyfuturenow.com/articles/the-rise-of-the-west-was-based-on-luck-that-has-run-out",
  "part": "Global Balance of Power",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "For over 500 years, since the successful conquest of the Americas by Atlantic Ocean facing European countries, the West has dominated the world in…",
      "link": "https://www.historyfuturenow.com/articles/the-rise-of-the-west-was-based-on-luck-that-has-run-out",
      "full": "For over 500 years, since the successful conquest of the Americas by Atlantic Ocean facing European countries, the West has dominated the world in… https://www.historyfuturenow.com/articles/the-rise-of-the-west-was-based-on-luck-that-has-run-out"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Many Westerners fret about the relative decline of the West.",
        "Full article: https://www.historyfuturenow.com/articles/the-rise-of-the-west-was-based-on-luck-that-has-run-out"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "GDP Share by Civilisation, 1-2025 AD. For most of history, Asia dominated. Western dominance was an anomaly.",
      "chart_title": "GDP Share by Civilisation, 1-2025 AD",
      "image": "images/articles/the-rise-of-the-west-was-based-on-luck-that-has-run-out/chart-luckChart1.png",
      "source": "Angus Maddison Project Database, World Bank WDI"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Many Westerners fret about the relative decline of the West. For over 500 years, since the successful conquest of the Americas by Atlantic Ocean facing European countries, the West has dominated the world in terms of wealth, power, influence and culture.\n\nThis domination is ending and Westerners are struggling to come to terms with their new status. There is a lot of debate as to why this has been happening: high levels of private and national debt; a social net that is too expensive; loss of manufacturing and service jobs to lower cost countries; too much free trade; not enough free trade; not enough education; wealth inequality; too high taxation; too low taxation and so forth. None of these explanations are satisfying, many are contradictory and they focus on relatively short term issues.\n\nIn this article History Future Now steps back and looks at 500 years of Western history to see if there is a more satisfying explanation for this decline.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-rise-of-the-west-was-based-on-luck-that-has-run-out\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if the Rise of the West Was Based on Luck. That Has Run Out?"
    },
    "quote_card": {
      "platform": "both",
      "text": "In 1824 the Spanish Empire in North America collapsed and a new country, Mexico, took its place.",
      "char_count": 96
    }
  }
}