{
  "slug": "the-return-of-the-state-factory-why-nations-that-forgot-how-to-make-things-are-remembering",
  "title": "The Return of the State Factory: Why Nations That Forgot How To Make Things Are Remembering",
  "url": "https://www.historyfuturenow.com/articles/the-return-of-the-state-factory-why-nations-that-forgot-how-to-make-things-are-remembering",
  "part": "Jobs & Economy",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Over 2.5 million jobs have been reshored or created through foreign direct investment in the US since 2010, with…",
      "link": "https://www.historyfuturenow.com/articles/the-return-of-the-state-factory-why-nations-that-forgot-how-to-make-things-are-remembering",
      "full": "Over 2.5 million jobs have been reshored or created through foreign direct investment in the US since 2010, with… https://www.historyfuturenow.com/articles/the-return-of-the-state-factory-why-nations-that-forgot-how-to-make-things-are-remembering"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In February 2026, the United States finalised a trade deal with Taiwan that set tariffs at 15%, secured $250 billion in corporate investment pledges for American semiconductor and AI production, and included $84 billion in Taiwanese purchases of American…",
        "The English East India Company, established in 1600, eventually came to dominate the Indian subcontinent.",
        "Alexander Hamilton, the first Secretary of the Treasury, submitted his \"Report on Manufactures\" to Congress in 1791.",
        "After 1945, the United States found itself in an existential struggle with the Soviet Union.",
        "When Russia invaded Ukraine in 2022, the European Union pledged to deliver one million artillery shells to Ukraine within a year.",
        "Full article: https://www.historyfuturenow.com/articles/the-return-of-the-state-factory-why-nations-that-forgot-how-to-make-things-are-remembering"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Manufacturing as % of GDP: The West vs China. Western nations hollowed out their manufacturing base while China built the largest industrial economy in history",
      "chart_title": "Manufacturing as % of GDP: The West vs China",
      "image": "images/articles/the-return-of-the-state-factory-why-nations-that-forgot-how-to-make-things-are-remembering/chart-factoryChart1.png",
      "source": "World Bank, National Bureau of Statistics of China, OECD"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "What happened after American independence is one of the most important and least understood episodes in economic history. The United States did not embrace free trade. It did the opposite.\n\nAlexander Hamilton, the first Secretary of the Treasury, submitted his \"Report on Manufactures\" to Congress in 1791. It is one of the most consequential economic documents ever written, and it explicitly rejected the free trade theories of Adam Smith. Hamilton argued that a young nation could not compete against established industrial powers on equal terms. British manufacturers had decades of accumulated expertise, capital, and scale. American manufacturers had none of these things. In a free market, British goods would flood America, American infant industries would be crushed in the cradle, and the United States would remain a raw materials exporter — a colony in all but name.\n\nHamilton's solution was comprehensive: high tariffs on imported manufactured goods, government subsidies for domestic manufacturers, investment in infrastructure (roads, canals, ports), and the active recruitment of skilled workers and industrial secrets from Britain. He understood that manufacturing was not just about economics. It was about national sovereignty. A nation that cannot make its own goods cannot arm its own soldiers, equip its own navy, or sustain itself in a crisis.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-return-of-the-state-factory-why-nations-that-forgot-how-to-make-things-are-remembering\n\n#Economy #FutureOfWork #Automation #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Economy",
        "#FutureOfWork",
        "#Automation",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "Why Nations That Forgot How To Make Things Are Remembering?"
    },
    "quote_card": {
      "platform": "both",
      "text": "Morgan Stanley has called 2026 an inflection point for American manufacturing transformation.",
      "char_count": 93
    }
  }
}