{
  "slug": "the-debasement-why-every-great-power-that-borrowed-its-way-to-greatness-borrowed-its-way-to-ruin",
  "title": "The Debasement: Why Every Great Power That Borrowed Its Way to Greatness Borrowed Its Way to Ruin",
  "url": "https://www.historyfuturenow.com/articles/the-debasement-why-every-great-power-that-borrowed-its-way-to-greatness-borrowed-its-way-to-ruin",
  "part": "Jobs & Economy",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Net interest on the federal debt reached $952 billion, surpassing the $886 billion Pentagon budget and…",
      "link": "https://www.historyfuturenow.com/articles/the-debasement-why-every-great-power-that-borrowed-its-way-to-greatness-borrowed-its-way-to-ruin",
      "full": "Net interest on the federal debt reached $952 billion, surpassing the $886 billion Pentagon budget and… https://www.historyfuturenow.com/articles/the-debasement-why-every-great-power-that-borrowed-its-way-to-greatness-borrowed-its-way-to-ruin"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In fiscal year 2025, the United States government spent more on interest payments than on national defence for the first time in its history.",
        "Carmen Reinhart and Kenneth Rogoff, in their magisterial survey of eight hundred years of financial crises, demonstrated that sovereign default is not an aberration but a near-universal feature of state finance (Reinhart and Rogoff, 2009).",
        "Global government debt exceeded $100 trillion in 2024, according to the International Monetary Fund — roughly 93% of global GDP (IMF, 2024).",
        "In the words of Stephanie Kelton, its most prominent evangelist, the federal budget \"is not like a household budget\" and deficits are merely \"an accounting record\" rather than a genuine constraint (Kelton, 2020).",
        "It is a claim on future wealth.",
        "Full article: https://www.historyfuturenow.com/articles/the-debasement-why-every-great-power-that-borrowed-its-way-to-greatness-borrowed-its-way-to-ruin"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "The numbers today are of a scale that would have given Philip II's Genoese bankers a collective seizure.\n\nGlobal government debt exceeded $100 trillion in 2024, according to the International Monetary Fund — roughly 93% of global GDP (IMF, 2024). This figure has nearly tripled since 2007, when it stood at $36 trillion. In the space of seventeen years, the governments of the world have borrowed more than they had accumulated in the entirety of recorded history prior to 2007.\n\nThe United States leads the pack in absolute terms, with a national debt of approximately $36.2 trillion in early 2026, representing roughly 124% of GDP (US Treasury, 2026). This is higher, as a proportion of GDP, than at any point since World War II, and it is growing at approximately $1.8 trillion per year — roughly $5 billion per day, or $57,000 per second. The Congressional Budget Office projects that, under current law, debt will reach 166% of GDP by 2054 (CBO, 2024). Under less optimistic assumptions — a recession, another war, another pandemic, or simply the continuation of current political incentives — it could reach 200% within two decades.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-debasement-why-every-great-power-that-borrowed-its-way-to-greatness-borrowed-its-way-to-ruin\n\n#Economy #FutureOfWork #Automation #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Economy",
        "#FutureOfWork",
        "#Automation",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "Why Every Great Power That Borrowed Its Way to Greatness Borrowed Its Way to Ruin?"
    },
    "quote_card": {
      "platform": "both",
      "text": "France's fiscal crisis destroyed the livelihoods of millions of commoners while the nobility retained their estates until the Revolution physically took them away.",
      "char_count": 163
    }
  }
}