{
  "slug": "the-severed-circuit-how-the-us-china-tech-war-is-splitting-the-world-in-two",
  "title": "The Severed Circuit: How the US-China Tech War Is Splitting the World in Two",
  "url": "https://www.historyfuturenow.com/articles/the-severed-circuit-how-the-us-china-tech-war-is-splitting-the-world-in-two",
  "part": "Global Balance of Power",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "On 7 October 2022, the United States Bureau of Industry and Security issued a set of export controls that may prove to be the…",
      "link": "https://www.historyfuturenow.com/articles/the-severed-circuit-how-the-us-china-tech-war-is-splitting-the-world-in-two",
      "full": "On 7 October 2022, the United States Bureau of Industry and Security issued a set of export controls that may prove to be the… https://www.historyfuturenow.com/articles/the-severed-circuit-how-the-us-china-tech-war-is-splitting-the-world-in-two"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 On 7 October 2022, the United States Bureau of Industry and Security issued a set of export controls that may prove to be the most consequential piece of economic policy since the Marshall Plan.",
        "The global semiconductor industry generates roughly $600 billion in annual revenue (SIA, 2024), but the products it enables are worth tens of trillions.",
        "From roughly 200 BC to AD 650, the Mediterranean world and the Iranian plateau developed sophisticated but largely separate technological ecosystems.",
        "The Chinese ecosystem has its own champions: Baidu's Ernie, Alibaba's Qwen, and — most strikingly — DeepSeek, whose R1 model shocked Western observers in January 2025 by matching frontier American models at a fraction of the reported training cost.",
        "When that openness contracted — when orthodoxy tightened, when the gates closed — innovation declined (Mokyr, 2002).",
        "Full article: https://www.historyfuturenow.com/articles/the-severed-circuit-how-the-us-china-tech-war-is-splitting-the-world-in-two"
      ]
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "The idea that the world might divide into two incompatible technological civilisations sounds dramatic. It has happened before. More than once.\n\nThe deepest historical parallel is the millennium-long rivalry between Rome and Persia. From roughly 200 BC to AD 650, the Mediterranean world and the Iranian plateau developed sophisticated but largely separate technological ecosystems. Both empires built roads, aqueducts, administrative systems, and military technologies. Both were literate, urban, and commercially active. But they shared remarkably little. Roman concrete, arch construction, and urban planning had no Persian equivalents. Persian irrigation techniques, cavalry warfare, and administrative practices — the Sassanid postal system was the most efficient in the ancient world — had no Roman parallels. The two empires traded luxury goods across their shared frontier, but they did not trade technology or technical knowledge in any systematic way (Canepa, 2009).\n\nThe result was that for over eight centuries, two of the most advanced civilisations on Earth developed in parallel but in isolation. When Rome fell, Persian technology did not fill the gap in the West. When Persia fell to the Arab conquests, Roman technology did not rescue the East. Each collapse was absolute within its own ecosystem. The technologies of one civilisation were not portable to the other because the underlying standards, materials, training, and institutional knowledge were incompatible.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-severed-circuit-how-the-us-china-tech-war-is-splitting-the-world-in-two\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "How the US-China Tech War Is Splitting the World in Two?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The two empires traded luxury goods across their shared frontier, but they did not trade technology or technical knowledge in any systematic way (Canepa, 2009).",
      "char_count": 160
    }
  }
}