{
  "slug": "the-scramble-for-the-solar-system-why-the-next-colonial-race-has-already-begun",
  "title": "The Scramble For The Solar System: Why The Next Colonial Race Has Already Begun",
  "url": "https://www.historyfuturenow.com/articles/the-scramble-for-the-solar-system-why-the-next-colonial-race-has-already-begun",
  "part": "Global Balance of Power",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "In 1494, Pope Alexander VI drew a line down the middle of the Atlantic Ocean.",
      "link": "https://www.historyfuturenow.com/articles/the-scramble-for-the-solar-system-why-the-next-colonial-race-has-already-begun",
      "full": "In 1494, Pope Alexander VI drew a line down the middle of the Atlantic Ocean. https://www.historyfuturenow.com/articles/the-scramble-for-the-solar-system-why-the-next-colonial-race-has-already-begun"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In 1494, Pope Alexander VI drew a line down the middle of the Atlantic Ocean.",
        "The romantic version of colonial history emphasises curiosity, adventure, and the human spirit of exploration.",
        "The Solar System is not empty.",
        "The English East India Company, chartered in 1600, was a private corporation with shareholders, a board of directors, and a profit motive.",
        "The Commercial Space Launch Competitiveness Act of 2015 explicitly grants US citizens the right to own and sell resources extracted from asteroids and other celestial bodies.",
        "Full article: https://www.historyfuturenow.com/articles/the-scramble-for-the-solar-system-why-the-next-colonial-race-has-already-begun"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Cost to Launch 1 kg to Low Earth Orbit. SpaceX has reduced launch costs by 97% since the Space Shuttle era — and Starship aims to cut them by another 90%",
      "chart_title": "Cost to Launch 1 kg to Low Earth Orbit",
      "image": "images/articles/the-scramble-for-the-solar-system-why-the-next-colonial-race-has-already-begun/chart-solarChart1.png",
      "source": "NASA, SpaceX public filings, industry estimates. Starship figure is target cost."
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "The Solar System is not empty. It is extraordinarily rich.\n\nThe Moon contains significant deposits of helium-3, a potential fuel for fusion reactors, as well as water ice at the poles (critical for sustaining human presence and manufacturing rocket fuel), and rare earth elements. Lunar regolith can be processed into building materials. The Moon's low gravity makes it an ideal staging point for deeper space missions — launching from the lunar surface requires roughly one-twentieth the energy of launching from Earth.\n\nThe asteroid belt contains mineral wealth that dwarfs anything on Earth. A single metallic asteroid — 16 Psyche, which NASA is currently studying — is estimated to contain iron, nickel, and gold worth approximately $10,000 quadrillion at current market prices. Even a small metallic asteroid could contain more platinum-group metals than have ever been mined in human history. These are not theoretical resources. They are physical objects with known compositions, orbiting in predictable paths.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-scramble-for-the-solar-system-why-the-next-colonial-race-has-already-begun\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "Why The Next Colonial Race Has Already Begun?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The question is not whether humans will establish a permanent presence beyond Earth.",
      "char_count": 84
    }
  }
}