{
  "slug": "the-renewables-and-battery-revolution",
  "title": "The renewables and battery revolution. What history teaches us about the future.",
  "url": "https://www.historyfuturenow.com/articles/the-renewables-and-battery-revolution",
  "part": "Natural Resources",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "History Future Now has worked in the energy sector for over 20 years in a career that has included coal and natural gas power stations, oil refineries, and renewable…",
      "link": "https://www.historyfuturenow.com/articles/the-renewables-and-battery-revolution",
      "full": "History Future Now has worked in the energy sector for over 20 years in a career that has included coal and natural gas power stations, oil refineries, and renewable… https://www.historyfuturenow.com/articles/the-renewables-and-battery-revolution"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 The advent of cheap renewable energy and battery storage has already started to change the world.",
        "Full article: https://www.historyfuturenow.com/articles/the-renewables-and-battery-revolution"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Global Energy Transitions Over 250 Years. Share of global primary energy by source, 1800-2025",
      "chart_title": "Global Energy Transitions Over 250 Years",
      "image": "images/articles/the-renewables-and-battery-revolution/chart-renChart1.png",
      "source": "Our World in Data, BP Statistical Review, Smil (2017)"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "The advent of cheap renewable energy and battery storage has already started to change the world. It is not an exaggeration to call this change a “revolution”. Some companies and countries will make it through this revolution stronger and better. Many will fail.\n\nIf you are a leader in an energy related company or a government minister you need to understand the dynamics of this revolution in order to manage your way through this transition. History Future Now has worked in the energy sector for over 20 years in a career that has included coal and natural gas power stations, oil refineries, and renewable energy such as solar, wind, tidal, wave, biomass, biofuels and heat recovery systems.\n\nIn this article History Future Now is going to briefly describe the energy revolution that is taking place and will then go back in time to look at how other leaders managed the previous energy revolutions of coal and oil. What did they do right? Where did they go wrong? We will then move forward in time and see how the changes taking place today are likely to impact our future.\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-renewables-and-battery-revolution\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "The renewables and battery revolution. What history teaches us about the future?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The Napoleonic Wars, which started shortly after the French Revolution in 1789, increased the demand for oak, which was used for building ships, and triggered even more deforestation.",
      "char_count": 183
    }
  }
}