{
  "slug": "the-north-african-threat-and-mediterranean-reunification",
  "title": "The North African Threat And Mediterranean Reunification",
  "url": "https://www.historyfuturenow.com/articles/the-north-african-threat-and-mediterranean-reunification",
  "part": "Global Balance of Power",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "In the last few years most of its countries have been convulsed by revolutions and are in disarray.",
      "link": "https://www.historyfuturenow.com/articles/the-north-african-threat-and-mediterranean-reunification",
      "full": "In the last few years most of its countries have been convulsed by revolutions and are in disarray. https://www.historyfuturenow.com/articles/the-north-african-threat-and-mediterranean-reunification"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 North Africa does not appear to be a military and political threat to the European Union.",
        "Full article: https://www.historyfuturenow.com/articles/the-north-african-threat-and-mediterranean-reunification"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Population Growth: North Africa vs Southern Europe. The demographic lines are crossing — and the implications are profound",
      "chart_title": "Population Growth: North Africa vs Southern Europe",
      "image": "images/articles/the-north-african-threat-and-mediterranean-reunification/chart-nafChart1.png",
      "source": "UN World Population Prospects 2024"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "North Africa does not appear to be a military and political threat to the European Union.  Why should it?  In the last few years most of its countries have been convulsed by revolutions and are in disarray.   Previous dictators and rulers that the West was not supposed to like are either dead or in exile.  The North African economy is weak, its people impoverished and its military capability is a joke.  How can this possibly be seen as a threat to the member states of the European Union?  The reason is demographics.  The likely outcome of the demographic trend is frightening, but History Future Now offers a solution.  It won't be easy and nobody will like it. The alternative is worse, however.\n\nBut before we go into more detail, it is worth reminding ourselves about the countries of North Africa and the history that they share with Europe.  Most History Future Now readers will be unfamiliar with North African history. As we will see, the people there are both very different and very similar to us in the European Union.  If you are familiar forgive me for the short background to the main thrust of this article. And a refresher is never bad either. Read on.\n\nThe dual history of North African and Southern Europe - 650BC – 698AD\n\nRead the full essay: https://www.historyfuturenow.com/articles/the-north-african-threat-and-mediterranean-reunification\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if the North African Threat And Mediterranean Reunification?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The loss of North Africa helped to kill off the Roman Empire in the west as the loss of grain shipments and tax revenues made life in Rome almost impossible.",
      "char_count": 157
    }
  }
}