{
  "slug": "where-are-all-the-jobs-going-lessons-from-the-first-industrial-revolution-and-150-years-of-pain",
  "title": "Where Are All The Jobs Going? Lessons From The First Industrial Revolution. And 150 Years Of Pain.",
  "url": "https://www.historyfuturenow.com/articles/where-are-all-the-jobs-going-lessons-from-the-first-industrial-revolution-and-150-years-of-pain",
  "part": "Jobs & Economy",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "In a world which is seeing a simultaneous increase in the capabilities of robots and artificial intelligence…",
      "link": "https://www.historyfuturenow.com/articles/where-are-all-the-jobs-going-lessons-from-the-first-industrial-revolution-and-150-years-of-pain",
      "full": "In a world which is seeing a simultaneous increase in the capabilities of robots and artificial intelligence… https://www.historyfuturenow.com/articles/where-are-all-the-jobs-going-lessons-from-the-first-industrial-revolution-and-150-years-of-pain"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 In a world which is seeing a simultaneous increase in the capabilities of robots and artificial intelligence with the capacity to take over many factory and service sector jobs, and a significant increase in the world’s interconnected population, a natural…",
        "Full article: https://www.historyfuturenow.com/articles/where-are-all-the-jobs-going-lessons-from-the-first-industrial-revolution-and-150-years-of-pain"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Sector Employment Shifts: 250 Years. The great migration from farms to factories to offices to… what?",
      "chart_title": "Sector Employment Shifts: 250 Years",
      "image": "images/articles/where-are-all-the-jobs-going-lessons-from-the-first-industrial-revolution-and-150-years-of-pain/chart-indChart1.png",
      "source": "BLS, ONS, Maddison historical estimates"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "In a world which is seeing a simultaneous increase in the capabilities of robots and artificial intelligence with the capacity to take over many factory and service sector jobs, and a significant increase in the world’s interconnected population, a natural question to ask is: “Are there enough good jobs to go around for everyone?”\n\nTo many people, particularly those who hold positions of power in government and industry, the answer is simple: “Yes, so long as our population is sufficiently educated to take advantage of the jobs that will emerge in the future.” HFN suggests that this view is too simplistic and wrong.\n\nDue to a collective amnesia and to a lack of historical awareness, this view does not consider the disastrous, multi-generational, consequences that rapid industrialisation had for the under class/proletariat.  These detrimental effects were experienced not just in societies that were being industrialised, but also in countries that did not industrialise at all.\n\nRead the full essay: https://www.historyfuturenow.com/articles/where-are-all-the-jobs-going-lessons-from-the-first-industrial-revolution-and-150-years-of-pain\n\n#Economy #FutureOfWork #Automation #HistoryFutureNow #LongRead",
      "hashtags": [
        "#Economy",
        "#FutureOfWork",
        "#Automation",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if Where Are All The Jobs Going? Lessons From The First Industrial Revolution. And 150 Years Of Pain?"
    },
    "quote_card": {
      "platform": "both",
      "text": "The 1811-1817 Luddite movement, now permanently synonymous with backwards thinking people, was a symptom of a serious social crisis.",
      "char_count": 132
    }
  }
}