{
  "slug": "who-are-the-losers-in-the-energy-revolution",
  "title": "Who Are The Losers In The Energy Revolution?",
  "url": "https://www.historyfuturenow.com/articles/who-are-the-losers-in-the-energy-revolution",
  "part": "Natural Resources",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "We are going to crash through the 550 parts per million barrier of carbon dioxide equivalent.",
      "link": "https://www.historyfuturenow.com/articles/who-are-the-losers-in-the-energy-revolution",
      "full": "We are going to crash through the 550 parts per million barrier of carbon dioxide equivalent. https://www.historyfuturenow.com/articles/who-are-the-losers-in-the-energy-revolution"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 If you own shares in energy companies that do not focus on solar energy, you should consider selling now.",
        "Full article: https://www.historyfuturenow.com/articles/who-are-the-losers-in-the-energy-revolution"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Winners and Losers of the Energy Transition. Some sectors and countries will thrive, others face existential threats",
      "chart_title": "Winners and Losers of the Energy Transition",
      "image": "images/articles/who-are-the-losers-in-the-energy-revolution/chart-losersChart1.png",
      "source": "Analysis by History Future Now"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "If you own shares in energy companies that do not focus on solar energy, you should consider selling now. Steal a march on people still half asleep, and start buying into energy companies that do focus on solar. There is an energy revolution that is taking place and most of the incumbents in the energy sector won't make it. The driver for this solar revolution has nothing to do with climate change. As History Future Now has previously stated, arguing over climate change is now a waste of time. Clearly we have missed the boat in preventing serious climate change from occurring. We are going to crash through the 550 parts per million barrier of carbon dioxide equivalent. No amount of appealing to peoples’ consciences and lobbying national governments will stop that from happening. Those who religiously hold on to the belief that humans could not possibly be causing climate change are so entrenched in their beliefs that no amount of evidence will persuade them otherwise. This makes dinner parties far more agreeable as both climate change deniers and climate change campaigners can agree that nothing material will be done in time. The driver of the solar revolution also has nothing to do with national energy security. For a short while environmental campaigners sought to persuade governments to invest in renewables for national security reasons. Reliance on Russian or Middle East oil and gas makes it more likely that Europe and America will find itself in perpetual conflict with those…\n\nRead the full essay: https://www.historyfuturenow.com/articles/who-are-the-losers-in-the-energy-revolution\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "What if Who Are The Losers In The Energy Revolution?"
    },
    "quote_card": {
      "platform": "both",
      "text": "There is an energy revolution that is taking place and most of the incumbents in the energy sector won't make it.",
      "char_count": 113
    }
  }
}