{
  "slug": "why-land-deals-in-africa-could-make-the-great-irish-famine-a-minor-event",
  "title": "Why Land Deals In Africa Could Make The Great Irish Famine A Minor Event",
  "url": "https://www.historyfuturenow.com/articles/why-land-deals-in-africa-could-make-the-great-irish-famine-a-minor-event",
  "part": "Natural Resources",
  "posts": {
    "hook": {
      "platform": "twitter",
      "text": "Which brings us to the Great Irish Famine of 1845 and 1852 when over one million people died and another million emigrated from…",
      "link": "https://www.historyfuturenow.com/articles/why-land-deals-in-africa-could-make-the-great-irish-famine-a-minor-event",
      "full": "Which brings us to the Great Irish Famine of 1845 and 1852 when over one million people died and another million emigrated from… https://www.historyfuturenow.com/articles/why-land-deals-in-africa-could-make-the-great-irish-famine-a-minor-event"
    },
    "thread": {
      "platform": "twitter",
      "tweets": [
        "🧵 Some of you may have noticed some land deals in Africa being announced in the press over the past few years.",
        "Full article: https://www.historyfuturenow.com/articles/why-land-deals-in-africa-could-make-the-great-irish-famine-a-minor-event"
      ]
    },
    "chart_insight": {
      "platform": "both",
      "text": "Foreign Land Acquisitions in Africa. Millions of hectares of African farmland acquired by foreign nations and corporations",
      "chart_title": "Foreign Land Acquisitions in Africa",
      "image": "images/articles/why-land-deals-in-africa-could-make-the-great-irish-famine-a-minor-event/chart-landChart1.png",
      "source": "Land Matrix, Oxfam, GRAIN database"
    },
    "linkedin_essay": {
      "platform": "linkedin",
      "text": "Some of you may have noticed some land deals in Africa being announced in the press over the past few years. The stories invariably include China in the headlines “China Gives Up On Europe, Will Target Africa Instead” or “Chinese acquisitions: China buys up the world” or “Fears of Chinese land grab as Beijing’s billions buy up resources …”\n\nWhat is less well known is that these land grabs are part of a wider neo-colonial move on the part of many nations and private sector participants. Some researchers estimate that more than 200m hectares of land – 30 times the size of the Ireland – were sold or leased between 2000 and 2010. While China has purchased over 2.3 million hectares of farmland abroad, it is might not be the biggest player. US investors have purchased over 3.1 million hectares, Malaysian investors 3.1 million hectares, United Arab Emirates investors 2.2 million hectares, Indian investors 1.9 million hectares and Saudi Arabian investors over 1 million hectares. Ireland is 6.9 million hectares by way of comparison.\n\nSo what, you may argue. This has got to be a good thing. Africa has not benefited from the modern agricultural revolution and if we want to feed a population of 10 billion we need to make use of all of the world’s potential farmland. Which brings us to the Great Irish Famine of 1845 and 1852 when over one million people died and another million emigrated from Ireland, causing the population to fall by 20-25%.\n\nRead the full essay: https://www.historyfuturenow.com/articles/why-land-deals-in-africa-could-make-the-great-irish-famine-a-minor-event\n\n#History #FutureOfWork #HistoryFutureNow #LongRead",
      "hashtags": [
        "#History",
        "#FutureOfWork",
        "#HistoryFutureNow",
        "#LongRead"
      ]
    },
    "provocative_question": {
      "platform": "twitter",
      "text": "Why Land Deals In Africa Could Make The Great Irish Famine A Minor Event?"
    },
    "quote_card": {
      "platform": "both",
      "text": "Africa has not benefited from the modern agricultural revolution and if we want to feed a population of 10 billion we need to make use of all of the world’s potential farmland.",
      "char_count": 176
    }
  }
}